[
    {
        "instance_id": "bq011",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "How many pseudo users were active in the last 7 days but inactive in the last 2 days as of January 7, 2021?",
        "external_knowledge": "ga4_obfuscated_sample_ecommerce.events.md"
    },
    {
        "instance_id": "bq010",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Find the top-selling product among customers who bought 'Youtube Men’s Vintage Henley' in July 2017, excluding itself.",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq009",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Which traffic source receives the top revenue in 2017 and what is the difference (millions, rounded to two decimal places) between its highest and lowest revenue months?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq001",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "I wonder how many days between the first transaction and the first visit for each transacting visitor in Feburary 2017, along with the device used in the transaction.",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq002",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What's the maximum monthly, weekly, and daily product revenues (in millions) generated by the top-performing traffic source in the first half of 2017?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq003",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Compare the average pageviews per visitor between purchase and non-purchase sessions for each month from April to July in 2017.",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq004",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What's the most popular other purchased product in July 2017 with consumers who bought products relevant to YouTube?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq008",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What's the most common next page for visitors who were part of \"Data Share\" campaign and after they accessed the page starting with '/home' in January 2017. And what's the maximum duration time (in seconds) when they visit the corresponding home page?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq269",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Compute the average pageviews per visitor for non-purchase events and purchase events each month between June 1st and July 31st in 2017.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq268",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Identify the longest number of days between the first visit and the last recorded event (either the last visit or the first transaction) for a user where the last recorded event was associated with a mobile device.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq270",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What were the monthly add-to-cart and purchase conversion rates, calculated as a percentage of pageviews, from January to March 2017?",
        "external_knowledge": "ga360_hits.eCommerceAction.action_type.md"
    },
    {
        "instance_id": "bq275",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Can you provide a list of visitor IDs for those who made their first transaction on a mobile device on a different day than their first visit?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq374",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Calculates the percentage of new users who, between August 1, 2016 and April 30, 2017, both stayed on the site for more than 5 minutes during their initial visit and made a purchase on a subsequent visit, relative to the total number of new users in the same period.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq029",
        "db": "spider2-public-data.patents",
        "question": "Get the number of patent publications and the average number of inventors per patent in the US every five years from 1945 to 2020?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq026",
        "db": "spider2-public-data.patents",
        "question": "For the assignee who has been the most active in the patent category 'A61', I'd like to know the five patent jurisdictions code where they filed the most patents during their busiest year, separated by commas.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq026_1",
        "db": "spider2-public-data.patents",
        "question": "In which year did the assignee with the most applications in the patent category 'A61' file the most?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq026_2",
        "db": "spider2-public-data.patents",
        "question": "For patent class A01B3, I want to analyze the information of the top 3 assignees based on the total number of applications. Please provide the following five pieces of information: the names of these assignees, their total number of applications, the year with the most applications, the number of applications in that year, and the country code with the most applications during that year.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq033",
        "db": "spider2-public-data.patents",
        "question": "How many U.S. patent applications related to IoT applications (where the abstract includes the phrase 'internet of things') were filed each month from 2008 to 2022?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq209",
        "db": "spider2-public-data.patents",
        "question": "Can you find how many utility patents granted in 2010 have exactly one forward citation within the ten years following their application date?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq027",
        "db": "spider2-public-data.patents",
        "question": "For patents granted between 2010 and 2018, provide the publication number of each patent and the number of backward citations it has received in the SEA category.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq210",
        "db": "spider2-public-data.patents",
        "question": "How many US B2 patents granted between 2008 and 2018 contain claims that do not include the word 'claim'?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq211",
        "db": "spider2-public-data.patents",
        "question": "Among patents granted between 2010 and 2023 in CN, how many of them belong to families that have a total of over one distinct applications?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq213",
        "db": "spider2-public-data.patents",
        "question": "What is the most common 4-digit IPC code among US B2 utility patents granted from June to August in 2022?",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq213_1",
        "db": "spider2-public-data.patents",
        "question": "For US B2 utility patents granted from June to September in 2022, identify the most frequent 4-digit IPC code for each patent. Then, list the publication numbers and IPC4 codes of patents where this code appears 10 or more times.",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq214",
        "db": "spider2-public-data.patents_google",
        "question": "For US B2 patents granted between 2010 and 2014, find the one with the most forward citations within a month of its filing date, and identify the most similar patent from the same filing year, regardless of its type.",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq214_1",
        "db": "spider2-public-data.patents_google",
        "question": "Identify the top five patents filed in the same year as `US-9741766-B2` that are most similar to it based on technological similarities. Please provide the publication numbers.",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq247",
        "db": "spider2-public-data.patents_google",
        "question": "Which valid family has the most publications? Just provide their non-empty publication abstracts.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq215",
        "db": "spider2-public-data.patents",
        "question": "What is the publication number of US patent granted during 2015 to 2018, with the highest originality score based on the diversity of 4-digits IPC codes from its backward citations?",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq222",
        "db": "spider2-public-data.patents",
        "question": "Find the CPC technology areas in Germany with the highest exponential moving average of patent filings each year (smoothing factor 0.1) for patents granted in December 2016. Show me the full title, CPC group and the best year for each CPC group at level 4.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq221",
        "db": "spider2-public-data.patents",
        "question": "Identify the CPC technology areas with the highest exponential moving average of patent filings each year (smoothing factor 0.2), and provide the full title and the best year for each CPC group at level 5.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq223",
        "db": "spider2-public-data.patents",
        "question": "Which assignee and primary CPC subclass full title most frequently cite patents assigned to 'DENSO CORP'?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq420",
        "db": "spider2-public-data.patents\nbigquery-public-data.uspto_oce_assignment\nbigquery-public-data.uspto_oce_cancer\nbigquery-public-data.uspto_oce_claims\nbigquery-public-data.uspto_oce_litigation\nbigquery-public-data.uspto_ptab",
        "question": "Can you identify the top 5 patents that were initially rejected under section 101 with no allowed claims, based on the length of their granted claims? The patents should have been granted in the US between 2010 and 2023. Additionally, ensure to select the first office action date for each application. Please include their first publication numbers, along with their first publication dates, length of the filed claims and grant dates.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq207",
        "db": "spider2-public-data.patents\nbigquery-public-data.uspto_oce_assignment\nbigquery-public-data.uspto_oce_cancer\nbigquery-public-data.uspto_oce_claims\nbigquery-public-data.uspto_oce_litigation\nbigquery-public-data.uspto_ptab",
        "question": "Can you provide the initial publication numbers for our top 100 independent patent claims with the highest word count?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq246",
        "db": "spider2-public-data.patentsview",
        "question": "Can you figure out the number of forward citations within 3 years from the application date for the patent that has the most backward citations within 3 years from application among all U.S. patents?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq052",
        "db": "spider2-public-data.patentsview",
        "question": "I wonder which patents within CPC subsection 'C05' or group 'A01G' in the USA have at least one forward or backward citations within one month of their application dates. Give me the ids, titles, application date, forward/backward citation counts and summary texts.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq036",
        "db": "spider2-public-data.github_repos",
        "question": "What was the average number of GitHub commits made per month in 2016 for repositories containing Python code?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq100",
        "db": "spider2-public-data.github_repos",
        "question": "Find out the most frequently used package in all Go source files.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq101",
        "db": "spider2-public-data.github_repos",
        "question": "Identify the top 10 most frequently imported packages and their counts in Java source files.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq182",
        "db": "spider2-public-data.github_repos\ngithubarchive.day\ngithubarchive.month\ngithubarchive.year",
        "question": "Which primary programming languages, determined by the highest number of bytes in each repository, have its repositories having at least a total of 100 pull requests on January 18, 2023?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq182_1",
        "db": "spider2-public-data.github_repos\ngithubarchive.day\ngithubarchive.month\ngithubarchive.year",
        "question": "How many pull requests in total were created in repositories that include JavaScript as one of their languages, considering data from January 18, 2023?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq191",
        "db": "spider2-public-data.github_repos\ngithubarchive.day\ngithubarchive.month\ngithubarchive.year",
        "question": "Find the top 5 repositories from 2017, which have more than 30 unique users watching them, that also contain the text 'Copyright (c)'. List these repositories in descending order of the watches they have.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq224",
        "db": "spider2-public-data.github_repos\ngithubarchive.day\ngithubarchive.month\ngithubarchive.year",
        "question": "Which repository with an approved license in `licenses.md` had the highest combined total of forks, issues, and watches in April 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq192",
        "db": "spider2-public-data.github_repos",
        "question": "Which repository that has a license of either \"artistic-2.0\", \"isc\", \"mit\", or \"apache-2.0\", contains Python files in the master branch, and has the highest combined count of forks, issues, and watch events in April 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq225",
        "db": "spider2-public-data.github_repos",
        "question": "What's the top 10 widely used languages according to file counts?",
        "external_knowledge": "lang_and_ext.md"
    },
    {
        "instance_id": "bq180",
        "db": "spider2-public-data.github_repos",
        "question": "Please help me retrieve the top 5 most frequently used module names from Python and R scripts.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq180_1",
        "db": "spider2-public-data.github_repos",
        "question": "Can you find the imported Python modules and R libraries from the GitHub sample files and list them along with their occurrence counts? Please sort the results by language and then by the number of occurrences in descending order.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq248",
        "db": "spider2-public-data.github_repos",
        "question": "Among all repositories not containing Python code that include a 'readme.md' file, what percentage of these README files contain the phrase 'Copyright (c)'?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq193",
        "db": "spider2-public-data.github_repos",
        "question": "Help me retrieve the top 5 most frequently occurring non-empty, non-commented lines of text in `readme.md` files from GitHub repositories that primarily use Python for development.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq295",
        "db": "spider2-public-data.github_repos",
        "question": "Among the repositories from the GitHub Archive which include a Python file with less than 15,000 bytes in size and a keyword 'def' in the content, find the top 3 that have the highest number of watch events in 2017?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq249",
        "db": "spider2-public-data.github_repos",
        "question": "Can you provide a report showing the counts of different types of lines in SQL files from the GitHub repository in descending order, specifically categorizing them into 'trailing' if there is at least one blank character at the end of the line, 'Space' if the line starts with at least one space, and 'Other' for any other types? ",
        "external_knowledge": null
    },
    {
        "instance_id": "bq375",
        "db": "spider2-public-data.github_repos",
        "question": "Determine which file type among Python (.py), C (.c), Jupyter Notebook (.ipynb), Java (.java), and JavaScript (.js) in the GitHub codebase has the most files with a directory depth greater than 10, and provide the file count.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq255",
        "db": "spider2-public-data.github_repos",
        "question": "How many commit messages are there in repositories that use the 'Shell' programming language and 'apache-2.0' license, where the length of the commit message is more than 5 characters but less than 10,000 characters, and the messages do not start with the word 'merge', 'update' or 'test'?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq194",
        "db": "spider2-public-data.github_repos",
        "question": "What is the second most frequently used module (imported library) across Python, R, and IPython script (.ipynb) files in the GitHub sample dataset?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq377",
        "db": "bigquery-public-data.github_repos",
        "question": "Extract PHP package names from the require field in composer.json files in GitHub repositories and count the occurrences of each package across all composer.json files.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq359",
        "db": "spider2-public-data.github_repos",
        "question": "List the repository names and commit counts for the top two GitHub repositories with JavaScript as the primary language and the highest number of commits.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq252",
        "db": "spider2-public-data.github_repos",
        "question": "Could you please find the name of the repository that contains the most copied non-binary Swift file in the dataset, ensuring each file is uniquely identified by its ID?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq251",
        "db": "spider2-public-data.pypi",
        "question": "Could you find the GitHub URL of the Python package that has the highest number of downloads on PyPi and was updated most recently? Please ensure that only the main repository URL is provided, excluding specific subsections like issues, blobs, pull requests, or tree views.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq019",
        "db": "bigquery-public-data.cms_medicare\nbigquery-public-data.cms_codes\nbigquery-public-data.cms_synthetic_patient_data_omop",
        "question": "For the most common inpatient diagnosis in the US in 2014, what was the citywise average payment respectively in the three cities that had the most cases?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq019_1",
        "db": "bigquery-public-data.cms_medicare\nbigquery-public-data.cms_codes\nbigquery-public-data.cms_synthetic_patient_data_omop",
        "question": "What is the most prescribed medication in each state in 2014?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq019_2",
        "db": "bigquery-public-data.cms_medicare\nbigquery-public-data.cms_codes\nbigquery-public-data.cms_synthetic_patient_data_omop",
        "question": "Can you tell me which healthcare provider incurs the highest combined average costs for both outpatient and inpatient services in 2014?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq172",
        "db": "bigquery-public-data.cms_medicare\nbigquery-public-data.cms_codes\nbigquery-public-data.cms_synthetic_patient_data_omop",
        "question": "For the drug with the highest total number of prescriptions in New York State during 2014, could you list the top five states with the highest total claim counts for this drug? Please also include their total claim counts and total drug costs. ",
        "external_knowledge": null
    },
    {
        "instance_id": "bq172_1",
        "db": "bigquery-public-data.cms_medicare\nbigquery-public-data.cms_codes\nbigquery-public-data.cms_synthetic_patient_data_omop",
        "question": "For the provider with the highest total inpatient service cost from 2011-2015, tell me its annual inpatient and outpatient costs for each year during that period.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq354",
        "db": "bigquery-public-data.cms_medicare\nbigquery-public-data.cms_codes\nbigquery-public-data.cms_synthetic_patient_data_omop",
        "question": "Could you provide the percentage of participants for standard acne, atopic dermatitis, psoriasis, and vitiligo defined by the International Classification of Diseases 10-CM(ICD-10-CM), including their subcategories? The ICD-10 codes are: Acne (L70), Atopic dermatitis (L20), Psoriasis (L40), and Vitiligo (L80). ",
        "external_knowledge": null
    },
    {
        "instance_id": "bq355",
        "db": "bigquery-public-data.cms_medicare\nbigquery-public-data.cms_codes\nbigquery-public-data.cms_synthetic_patient_data_omop",
        "question": "Please tell me the proportion of participants not using quinapril and related medications(Quinapril RxCUI: 35208).",
        "external_knowledge": null
    },
    {
        "instance_id": "bq032",
        "db": "bigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_gsod",
        "question": "Can you provide the latitude of the final coordinates for the hurricane that traveled the second longest distance in the North Atlantic during 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq032_1",
        "db": "bigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_gsod",
        "question": "Please show information of the hurricane with the third longest total travel distance, including its travel coordinates, the cumulative travel distance at each point, and the maximum sustained wind speed at those times.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq117",
        "db": "bigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads\nbigquery-public-data.noaa_gsod",
        "question": "What is the total number of severe storm events that occurred in the most affected month over the past 15 years according to NOAA records, considering only the top 100 storm events with the highest property damage?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq419",
        "db": "bigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads\nbigquery-public-data.noaa_gsod",
        "question": "Which 5 states had the most storm events from 1980 to 1995, considering only the top 1000 states with the highest event counts each year? Please use state abbreviations.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq071",
        "db": "bigquery-public-data.geo_us_boundaries\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_gsod",
        "question": "What are the top 10 zip codes of the areas in the United States that have been affected by the most named hurricanes?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq117_1",
        "db": "bigquery-public-data.geo_us_boundaries\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads\nbigquery-public-data.noaa_gsod",
        "question": "What are the top 5 zip codes of the areas in the United States that have experienced the most hail storm events in the past 10 years?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq356",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads",
        "question": "What is the number of weather stations where the valid temperature record days in 2019 reached 90% or more of the maximum number of recorded days, and have had tracking back to 1/1/2000 or before and through at least 6/30/2019?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq042",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads",
        "question": "Help me analyze the weather conditions (including temperature, wind speed and precipitation) at NYC's airport LaGuardia for June 12, year over year, starting from 2011 to 2020.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq394",
        "db": "bigquery-public-data.noaa_icoads\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_gsod",
        "question": "What are the top 3 months between 2010 and 2014 with the smallest sum of absolute differences between the average air temperature, wet bulb temperature, dew point temperature, and sea surface temperature, including respective years and sum of differences? Please present the year and month in numerical format.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq357",
        "db": "bigquery-public-data.noaa_icoads\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_gsod",
        "question": "What are the latitude and longitude coordinates and dates between 2005 and 2015 with the top 5 highest daily average wind speeds, excluding records with missing wind speed values?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq181",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads",
        "question": "How much percentage of weather stations recorded temperature data for at least 90% of the days in 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq045",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads",
        "question": "Which weather stations in Washington State had more than 150 rainy days in 2023 but fewer rainy days than in 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq358",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads",
        "question": "What are the starting and ending ZIP Code regions for bike trips in New York City during the summer of 2015 (July, Augest, September), with the highest daily mean temperature on the the trip's start day, based on weather data from the Central Park weather station '94728'?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq290",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads",
        "question": "Can you calculate the difference in maximum temperature, minimum temperature, and average temperature between US and UK weather stations for each day in October 2023, excluding records with missing temperature values?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq031",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.noaa_hurricanes\nbigquery-public-data.noaa_tsunami\nbigquery-public-data.noaa_significant_earthquakes\nbigquery-public-data.noaa_preliminary_severe_storms\nbigquery-public-data.noaa_pifsc_metadata\nbigquery-public-data.noaa_passive_bioacoustic\nbigquery-public-data.noaa_passive_acoustic_index\nbigquery-public-data.noaa_icoads",
        "question": "Show me the daily weather data (temperature, precipitation, and wind speed) in Rochester for the first season of year 2019, converted to Celsius, centimeters, and meters per second, respectively. Also, include the moving averages (window size = 8) and the differences between the moving averages for up to 8 days prior (all values rounded to one decimal place, sorted by date in ascending order, and records starting from 2019-01-09).",
        "external_knowledge": null
    },
    {
        "instance_id": "bq392",
        "db": "bigquery-public-data.noaa_gsod",
        "question": "What are the top 3 dates in October 2009 with the highest average temperature for station number 723758, in the format YYYY-MM-DD?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq050",
        "db": "bigquery-public-data.geo_us_boundaries\nbigquery-public-data.noaa_gsod\nbigquery-public-data.new_york_citibike\nspider2-public-data.cyclistic",
        "question": "Help me look at the total number of bike trips, average trip duration (in minutes), average daily temperature, wind speed, and precipitation when trip starts (rounded to 1 decimal), as well as the month with the most trips (e.g., `4`), categorized by different starting and ending neighborhoods in New York City for the year 2014.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq426",
        "db": "bigquery-public-data.new_york_citibike\nspider2-public-data.cyclistic",
        "question": "Which user type has the highest average temperature for trips starting and ending within New York City in 2018, based on weather data from the New York Central Park station? Also tell me the average precipitation, average wind speed, and average temperature for that user type.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq291",
        "db": "spider2-public-data.geo_openstreetmap\nspider2-public-data.noaa_global_forecast_system",
        "question": "What is the daily weather forecast summary, including temperature stats (max, min and average), precipitation, cloud cover, snow and rain, for the specified location (latitude 17.5, longitude 23.25) and on November 28, 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq208",
        "db": "bigquery-public-data.new_york\nbigquery-public-data.noaa_gsod",
        "question": "Can you provide weather stations within a 20-mile radius of Chappaqua, New York (Latitude: 41.197, Longitude: -73.764), and tell me the number of valid temperature observations they have recorded from 2011 to 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq047",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.new_york",
        "question": "Could you help me analyze the relationship between each complaint type and daily temperature in New York city, focusing on data in airports LaGuardia and JFK over the 10 years starting from 2008? Calculate the total complaint count, the total day count, and the Pearson correlation coefficient (rounded to 4 decimals) between temperature and both the count and percentage of each common (>5000 occurrences) and strongly correlated (absolute value > 0.5) complaint type.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq048",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.new_york",
        "question": "Which common complaint types have the strongest positive and negative correlation with wind speed respectively, given the data in NYC JFK Airport from year 2011 to 2020? Also, provide the corresponding correlation values (rounded to 4 decimals).",
        "external_knowledge": null
    },
    {
        "instance_id": "bq293",
        "db": "bigquery-public-data.geo_us_boundaries\nbigquery-public-data.new_york",
        "question": "What were the top 5 busiest pickup times and locations (by ZIP code) for yellow taxi rides in New York City on January 1, 2015? Additionally, provide detailed metrics for each of these top 5 records, including the count of rides, hourly, daily, and weekly lagged counts, as well as 14-day and 21-day average and standard deviation of ride counts.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq017",
        "db": "spider2-public-data.geo_openstreetmap",
        "question": "What are the five longest types of highways within the multipolygon boundary of Denmark (as defined by Wikidata ID 'Q35') by total length?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq131",
        "db": "spider2-public-data.geo_openstreetmap",
        "question": "What is the number of bus stops for the bus network with the most stops within the multipolygon boundary of Denmark (as defined by Wikidata ID 'Q35')?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq349",
        "db": "spider2-public-data.geo_openstreetmap",
        "question": "Which OpenStreetMap ID corresponds to the administrative boundary, represented as multipolygons, whose total number of 'amenity'-tagged Points of Interest (POIs) is closest to the median count among all such boundaries?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq348",
        "db": "spider2-public-data.geo_openstreetmap",
        "question": "What are the top 3 usernames with the largest number of historical nodes of hospitals, clinics, or doctors' offices tagged as amenities within the geographic area bounded by the geogpoints `(31.1798246, 18.4519921)`, `(54.3798246, 18.4519921)`, `(54.3798246, 33.6519921)`, and `(31.1798246, 33.6519921)` that are no longer present in the latest dataset (`planet nodes`)?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq253",
        "db": "spider2-public-data.geo_openstreetmap",
        "question": "Can you find the name of the relation from the OpenStreetMap data that has the most associated features within the same bounding area as the multipolygon with Wikidata item Q1095, where the relation itself does not have a Wikidata tag but its name is specified, and at least one of its associated features does have a Wikidata tag?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq254",
        "db": "spider2-public-data.geo_openstreetmap",
        "question": "Can you find the names of the multipolygons with valid ids that rank in the top two in terms of the number of points within their boundaries, among those multipolygons that do not have a Wikidata tag but are located within the same geographic area as the multipolygon associated with Wikidata item Q191?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq056",
        "db": "spider2-public-data.geo_openstreetmap\nbigquery-public-data.geo_us_boundaries",
        "question": "How many different pairs of roads classified as motorway, trunk, primary, secondary, or residential in California overlap each other without sharing nodes and do not have a bridge tag, where these roads are tagged with 'highway'",
        "external_knowledge": null
    },
    {
        "instance_id": "bq289",
        "db": "bigquery-public-data.geo_us_census_places\nspider2-public-data.geo_openstreetmap",
        "question": "Can you find the shortest distance between any two amenities (either a library, place of worship, or community center) located within Philadelphia?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq250",
        "db": "spider2-public-data.geo_openstreetmap\nspider2-public-data.worldpop",
        "question": "What is the total population living on the geography grid which is the farthest from any hospital in Singapore, based on the most recent population data before 2023? Note that geographic grids and distances are calculated based on geospatial data and GIS related functions.",
        "external_knowledge": "OpenStreetMap_data_in_layered_GIS_format.md"
    },
    {
        "instance_id": "bq184",
        "db": "spider2-public-data.crypto_ethereum",
        "question": "I want to compute and compare the cumulative count of Ethereum smart contracts created by users versus created by other contracts. Please list out the daily cumulative tallies between 2017 and 2021.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq195",
        "db": "spider2-public-data.crypto_ethereum",
        "question": "What are the top 10 Ethereum addresses by balance, considering both value transactions and gas fees, before September 1, 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq256",
        "db": "spider2-public-data.crypto_ethereum",
        "question": "What is the balance of the Ethereum address that initiated the highest number of transactions before September 1, 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq080",
        "db": "spider2-public-data.crypto_ethereum",
        "question": "Please provide the cumulative number(from the earliest date in the data) of contracts each day created by contracts and by users for the period from August 30, 2018, to September 30, 2018.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq342",
        "db": "spider2-public-data.crypto_ethereum",
        "question": "What is the difference between the average hourly changes in transaction values for the Ethereum token 0x68e54af74b22acaccffa04ccaad13be16ed14eac, involving the addresses 0x8babf0ba311aab914c00e8fda7e8558a8b66de5d and 0xfbd6c6b112214d949dcdfb1217153bc0a742862f as either sender or receiver, between the years 2019 and 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq341",
        "db": "spider2-public-data.crypto_ethereum",
        "question": "Which Ethereum address has the smallest positive balance from transactions involving the token at address \"0xa92a861fc11b99b24296af880011b47f9cafb5ab\" after March 17, 2023?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq340",
        "db": "spider2-public-data.crypto_ethereum",
        "question": "Which Ethereum address, excluding '0x0000000000000000000000000000000000000000', has the largest absolute difference between its previous and current balance from the tokens at addresses '0x0d8775f648430679a709e98d2b0cb6250d2887ef0' and '0x1e15c05cbad367f044cbfbafda3d9a1510db5513'?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq005",
        "db": "spider2-public-data.crypto_bitcoin",
        "question": "What are the average block intervals for Bitcoin blocks mined in 2023, broken down by date, and can you provide the first ten dates with their corresponding average intervals?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq334",
        "db": "spider2-public-data.crypto_bitcoin",
        "question": "Which year has the highest average Bitcoin transaction value across all transaction types?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq335",
        "db": "spider2-public-data.crypto_bitcoin",
        "question": "Which address, among those with the most recent transaction in October 2017, had the highest total transaction value?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq057",
        "db": "spider2-public-data.crypto_bitcoin",
        "question": "Which month (e.g., 3) in 2021 witnessed the highest percent of Bitcoin volume that took place in CoinJoin transactions? Also give me the percentage of CoinJoins transactions, the average input and output UTXOs ratio, and the proportion of CoinJoin transaction volume for that month (all 1 decimal).",
        "external_knowledge": null
    },
    {
        "instance_id": "bq068",
        "db": "spider2-public-data.crypto_bitcoin_cash",
        "question": "What are the maximum and minimum balances across all addresses for different address types on Bitcoin Cash during March 2014?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq092",
        "db": "spider2-public-data.crypto_dash",
        "question": "Tell me the highest and lowest net changes among all addresses and types on Bitcoin Cash as of April, 2023?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq093",
        "db": "spider2-public-data.crypto_ethereum_classic",
        "question": "Tell me the maximum and minimum net changes in balances for Ethereum Classic addresses on October 14, 2016, considering debits, credits, and gas fees, while excluding internal calls like 'delegatecall', 'callcode', and 'staticcall'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq292",
        "db": "spider2-public-data.crypto_bitcoin",
        "question": "Please analyse the monthly aggregated statistics and percentages of potential CoinJoin transactions within the Bitcoin network since July 1, 2023 as below. How much percent of monthly Bitcoin txs that were CoinJoins and what about the Bitcoin utxos? Also please show me the percent of monthly Bitcoin volume that took place in CoinJoined transactions.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq037",
        "db": "spider2-public-data.human_genome_variants",
        "question": "About the refined human genetic variations collected in phase 3 on 2015-02-20, I want to know the minimum and maximum start positions as well as the proportions of these two respectively for reference bases 'AT' and 'TA'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq135",
        "db": "spider2-public-data.crypto_zilliqa",
        "question": "Which date before 2022 had the highest total transaction amount in the Zilliqa blockchain data?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq065",
        "db": "spider2-public-data.crypto_band",
        "question": "Provide the most recent 10 results of symbols and their corresponding rates, adjusted for the multiplier, from oracle requests with the script ID 3.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq012",
        "db": "spider2-public-data.ethereum_blockchain",
        "question": "What is the average balance of the top 10 addresses with the most balance on the Ethereum blockchain, considering both incoming and outgoing transactions, as well as transaction fees? Only keep successful transactions with no call type or where the call type is 'call'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq187",
        "db": "spider2-public-data.ethereum_blockchain",
        "question": "What is the total circulating supply balances of the 'BNB' token for all addresses (excluding the zero address), based on the amount they have received (converted by dividing by 10^18) minus the amount they have sent?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq034",
        "db": "bigquery-public-data.ghcn_d",
        "question": "I would like to know the name of nearest 5 weather stations to the center of Chicago (41.8319°N, 87.6847°W).",
        "external_knowledge": null
    },
    {
        "instance_id": "bq383",
        "db": "bigquery-public-data.ghcn_d",
        "question": "Please tell me the daily maximum precipitation, the maximum value of the minimum and maximum temperature for the last 15 days of 2016 from station USW00094846 in ascending date order. Note that the data records precipitation in tenths of millimeters and temperatures in tenths of degrees Celsius. You don't need to count invalid or quality-deficient data.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq051",
        "db": "bigquery-public-data.ghcn_d\nbigquery-public-data.new_york",
        "question": "Get the average number of trips on rainy and non-rainy days in New York City during 2016, using data from the closest weather station located near the coordinates (longitude: -74.0060, latitude: 40.7128). Define a 'rainy day' as any day where the precipitation recorded is more than 0 millimeters.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq038",
        "db": "bigquery-public-data.new_york",
        "question": "Can you list the top 10 stations with the highest proportion of group rides? The group rides are trips that start and end at the same station within a 2-minute window.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq185",
        "db": "bigquery-public-data.new_york",
        "question": "What is the average valid trip duration (in minutes) for yellow taxi rides in Manhattan with more than 3 passengers and a trip distance of at least 10 miles between February 1 and February 7, 2016?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq053",
        "db": "bigquery-public-data.new_york",
        "question": "How has the number of trees of each fall color in New York City changed from 1995 to 2015, considering only trees that were still alive in 2015 and excluding those marked as dead in 1995?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq054",
        "db": "bigquery-public-data.new_york",
        "question": "Can you provide the top 10 tree species in New York, based on the growth in their population from 1995 to 2015, including the counts of trees, the counts of alive and dead trees for both years, and the respective growth values?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq021",
        "db": "bigquery-public-data.new_york",
        "question": "For the top 20 Citi Bike routes in 2016, which route is faster than yellow taxis and among those, which one has the longest average bike duration? Please provide the start station name of this route. The coordinates are rounded to three decimals.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq202",
        "db": "bigquery-public-data.new_york",
        "question": "For the station with the most trips in 2018, what are the peak day of the week (as a numeric value) and the peak hour of the day?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq040",
        "db": "bigquery-public-data.new_york_taxi_trips\nbigquery-public-data.new_york_trees\nbigquery-public-data.new_york_subway\nbigquery-public-data.new_york_mv_collisions\nbigquery-public-data.new_york_citibike\nbigquery-public-data.new_york_311",
        "question": "For NYC yellow taxi trips between January 1-7, 2016, excluding pickups from 'EWR' and 'Staten Island', calculate the proportion of trips by tip category for each pickup borough. Show the borough, tip category, and proportion, ensuring trips where the dropoff occurs after the pickup, the passenger count is greater than 0, and trip distance, tip, tolls, MTA tax, fare, and total amount are non-negative.",
        "external_knowledge": "taxi_tip_rate.md"
    },
    {
        "instance_id": "bq040_1",
        "db": "bigquery-public-data.new_york_taxi_trips\nbigquery-public-data.new_york_trees\nbigquery-public-data.new_york_subway\nbigquery-public-data.new_york_mv_collisions\nbigquery-public-data.new_york_citibike\nbigquery-public-data.new_york_311",
        "question": "For NYC yellow taxi trips between January 1-7, 2016, could you tell me the percentage of no tips in each borough. Ensure trips where the dropoff occurs after the pickup, the passenger count is greater than 0, and trip distance, tip, tolls, MTA tax, fare, and total amount are non-negative.",
        "external_knowledge": "taxi_tip_rate.md"
    },
    {
        "instance_id": "bq039",
        "db": "bigquery-public-data.new_york_taxi_trips\nbigquery-public-data.new_york_trees\nbigquery-public-data.new_york_subway\nbigquery-public-data.new_york_mv_collisions\nbigquery-public-data.new_york_citibike\nbigquery-public-data.new_york_311",
        "question": "Which are the top 10 taxi trips in New York City from July 1 to July 7, 2016, with more than 5 passengers, a trip distance of at least 10 miles, and a positive fare, ranked by total fare amount? Display the pickup and dropoff zones, trip duration, driving speed in miles per hour, and tip rate.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq203",
        "db": "bigquery-public-data.new_york_subway\nbigquery-public-data.new_york_taxi_trips\nbigquery-public-data.new_york_trees\nbigquery-public-data.new_york_mv_collisions\nbigquery-public-data.new_york_citibike\nbigquery-public-data.new_york_311",
        "question": "What percentage of subway stations in each New York borough have at least one ADA-compliant entrance?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq035",
        "db": "bigquery-public-data.san_francisco",
        "question": "What is the total distance traveled by each bike in the San Francisco Bikeshare program? Use data from bikeshare trips and stations to calculate this.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq186",
        "db": "bigquery-public-data.san_francisco",
        "question": "Please help me calculate the first, last, highest, and lowest bike trip durations in minutes for each month.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq294",
        "db": "bigquery-public-data.san_francisco_bikeshare\nbigquery-public-data.san_francisco_neighborhoods\nbigquery-public-data.san_francisco_311\nbigquery-public-data.san_francisco_film_locations\nbigquery-public-data.san_francisco_sffd_service_calls\nbigquery-public-data.san_francisco_sfpd_incidents\nbigquery-public-data.san_francisco_transit_muni\nbigquery-public-data.san_francisco_trees",
        "question": "Can you provide the details of the top 5 longest bike share trips that started during the second half of 2017, including the trip ID, duration in seconds, start date, start station name, route (start station to end station), bike number, subscriber type, member's birth year, age, age classification, gender, and the region name of the start station? Please exclude trips where the start station name, member's birth year, or member's gender is not specified.",
        "temporal": "Yes",
        "external_knowledge": "trip_info.md"
    },
    {
        "instance_id": "bq339",
        "db": "bigquery-public-data.san_francisco_bikeshare\nbigquery-public-data.san_francisco_neighborhoods\nbigquery-public-data.san_francisco_311\nbigquery-public-data.san_francisco_film_locations\nbigquery-public-data.san_francisco_sffd_service_calls\nbigquery-public-data.san_francisco_sfpd_incidents\nbigquery-public-data.san_francisco_transit_muni\nbigquery-public-data.san_francisco_trees",
        "question": "Which month in 2017 had the largest absolute difference between cumulative bike usage minutes for customers and subscribers?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq400",
        "db": "bigquery-public-data.san_francisco_transit_muni\nbigquery-public-data.san_francisco_bikeshare\nbigquery-public-data.san_francisco_neighborhoods\nbigquery-public-data.san_francisco_311\nbigquery-public-data.san_francisco_film_locations\nbigquery-public-data.san_francisco_sffd_service_calls\nbigquery-public-data.san_francisco_sfpd_incidents\nbigquery-public-data.san_francisco_trees",
        "question": "What are the start and end times of trips from 'Clay St & Drumm St' to 'Sacramento St & Davis St' (one direction only), in the format of HH:MM:SS? I also want the trip headsign for each route.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq059",
        "db": "bigquery-public-data.san_francisco_bikeshare\nbigquery-public-data.san_francisco_neighborhoods\nbigquery-public-data.san_francisco_311\nbigquery-public-data.san_francisco_film_locations\nbigquery-public-data.san_francisco_sffd_service_calls\nbigquery-public-data.san_francisco_sfpd_incidents\nbigquery-public-data.san_francisco_transit_muni\nbigquery-public-data.san_francisco_trees",
        "question": "What is the highest average speed (rounded to 1 decimal, in metric m/s) for bike trips in Berkeley with trip distance greater than 1000 meters?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq376",
        "db": "bigquery-public-data.san_francisco_bikeshare\nbigquery-public-data.san_francisco_neighborhoods\nbigquery-public-data.san_francisco_311\nbigquery-public-data.san_francisco_film_locations\nbigquery-public-data.san_francisco_sffd_service_calls\nbigquery-public-data.san_francisco_sfpd_incidents\nbigquery-public-data.san_francisco_transit_muni\nbigquery-public-data.san_francisco_trees",
        "question": "Which neighborhood has a crime count closest to the average crime count for all neighborhoods? if there is a tie, which neighborhood has the most bike share stations?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq014",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Can you help me figure out the revenue for the product category that has the highest number of customers making a purchase in their first non-cancelled and non-returned order?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq188",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "What is the average time in minutes that users spend per visit on the product category with the highest total quantity purchased?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq258",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Can you provide a report that shows, for each product category by month and year prior to 2023, the percentage growth in revenue compared to the previous month, the percentage growth in orders compared to the previous month, the total cost of products sold, the total profit earned, and the profit to cost ratio? ",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq259",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Can you provide the percentage of users who made a purchase in the first, second, and third months after their initial purchase, organized by the month of their first purchase, using data up until the end of 2023?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq189",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "What is the average monthly revenue growth rate for the product category with the highest average monthly order growth rate based on completed orders?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq260",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Find the total number of youngest and oldest users separately for each gender in the e-commerce platform created from January 1, 2019, to April 30, 2022.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq261",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "What is the total cost and profit of products whose profit rank first per month sorted chronologically? Only consider data before 2024.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq262",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Help me generate a monthly analysis report on e-commerce sales in the second half of 2019, which should contain the total sum of order count/revenue/profit as well as their growth rates for each product category monthly. Please sort the results by months (e.g., 2019-07) and product categories in ascending order.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq190",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "What is the count of the youngest and oldest users respectively, broken down by gender from January 2019 to April 2022?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq263",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Can you provide a report showing the total purchase value, total cost, total number of orders, total profit, and profit-to-cost ratio for product category ‘Sleep & Lounge’ each month in 2023? Make sure to only include completed orders.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq264",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Identify the difference in the number of the oldest and youngest users registered between January 1, 2019, and April 30, 2022, from our e-commerce platform data.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq197",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "What are the top-selling products by sales volume and revenue for June 2024 and each month before, considering only completed orders?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq265",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Can you provide me with the emails of the top 10 users who have the highest average order value, considering only those users who registered in 2019 and made purchases within the same year?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq266",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Can you provide me with the names of the products that had the lowest profit margin each month throughout the year 2020, excluding any months where this data isn't available? Please list them in chronological order based on the month.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq333",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Which are the top 3 browsers with the shortest average session duration, and what are their average session times? Only include browsers with more than 10 sessions.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq361",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "For the user cohort with a first purchase date in January 2020, what proportion of users returned in the subsequent months of 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq271",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Could you provide me with the country that had the highest profit from orders in 2021 and its profit, considering the difference between the total retail prices and the costs of products sold during the year?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq272",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Please provide me with the names of the top three most profitable products for each month between January 2019 and September 2022, excluding any products that were either canceled or returned.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq273",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Could you provide me with the top 5 months where there was the highest increase in profit compared to the previous month for completed orders made by users who came from Facebook, between January 1, 2022, and June 30, 2023?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq020_1",
        "db": "spider2-public-data.genomics_cannabis",
        "question": "What is the name of the reference sequence with the highest variant density in the given cannabis genome dataset?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq398",
        "db": "bigquery-public-data.world_bank_intl_debt\nbigquery-public-data.world_bank_wdi\nbigquery-public-data.world_bank_intl_education\nbigquery-public-data.world_bank_health_population\nbigquery-public-data.world_bank_global_population",
        "question": "What are the top three debt indicators for Russia based on the highest debt values?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq399",
        "db": "bigquery-public-data.world_bank_intl_debt\nbigquery-public-data.world_bank_wdi\nbigquery-public-data.world_bank_intl_education\nbigquery-public-data.world_bank_health_population\nbigquery-public-data.world_bank_global_population",
        "question": "Which high-income country had the highest average birth rate respectively in each region, and what are their corresponding average birth rate, during the 1980s?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq025",
        "db": "bigquery-public-data.census_bureau_international",
        "question": "Provide a list of the top 10 countries for the year 2020, ordered by the highest percentage of their population under 20 years old. For each country, include the total population under 20 years old, the total midyear population, and the percentage of the population that is under 20 years old.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq025_1",
        "db": "bigquery-public-data.census_bureau_international",
        "question": "Which country has the highest percentage of population under the age of 25 in 2017?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq030",
        "db": "bigquery-public-data.covid19_open_data",
        "question": "As of May 10, 2020, which three countries with over 50,000 confirmed COVID-19 cases had the highest recovery rates? Please provide the list of these countries along with their respective recovery rates.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq018",
        "db": "bigquery-public-data.covid19_open_data",
        "question": "Which day in March and April had the highest COVID-19 confirmed case growth rate in the United States? The format is MM-DD.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq086",
        "db": "bigquery-public-data.covid19_open_data\nbigquery-public-data.world_bank_intl_debt\nbigquery-public-data.world_bank_wdi\nbigquery-public-data.world_bank_intl_education\nbigquery-public-data.world_bank_health_population\nbigquery-public-data.world_bank_global_population",
        "question": "What percentage of each country’s population was confirmed to have COVID-19 as of June 30, 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq085",
        "db": "bigquery-public-data.covid19_jhu_csse\nbigquery-public-data.world_bank_intl_debt\nbigquery-public-data.world_bank_wdi\nbigquery-public-data.world_bank_intl_education\nbigquery-public-data.world_bank_health_population\nbigquery-public-data.world_bank_global_population",
        "question": "Could you provide the total number of confirmed COVID-19 cases and the number of cases per 100,000 people on April 20, 2021, for the US, France, China, Italy, Spain, Germany, and Iran, ranked by cases per 100,000 in descending order?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq130",
        "db": "bigquery-public-data.covid19_nyt",
        "question": "Please provide the state name and number of new COVID-19 cases for the top 3 state with the highest number of new cases on March 23, 2023.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq087",
        "db": "bigquery-public-data.covid19_symptom_search",
        "question": "Can you assess the collective percentage change in average search frequency for Anosmia symptoms across the five major boroughs of New York City from 2019 to 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq088",
        "db": "bigquery-public-data.covid19_symptom_search",
        "question": "Can you provide the average levels of anxiety and depression symptoms in the United States for the years 2019 and 2020, and calculate the percentage increase in these symptoms from 2019 to 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq089",
        "db": "bigquery-public-data.covid19_usafacts\nbigquery-public-data.covid19_vaccination_access\nbigquery-public-data.census_bureau_acs",
        "question": "What is the number of vaccine sites per 1000 people for counties in California?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq407",
        "db": "bigquery-public-data.covid19_usafacts\nbigquery-public-data.covid19_vaccination_access\nbigquery-public-data.census_bureau_acs",
        "question": "Find the top 3 counties with populations over 50,000 that had the highest COVID-19 deaths per 100,000 people on the first day of 2022. For these counties, provide the median age, total population, COVID-19 confirmed cases per 100,000, deaths per 100,000, and case fatality rate for that day.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq137",
        "db": "bigquery-public-data.census_bureau_usa\nbigquery-public-data.utility_us",
        "question": "Find details about zip code areas within 10 kilometers of the coordinates (-122.3321, 47.6062), including their geographic polygons, land and water area in meters, latitude and longitude points, state code, state name, city, county, and population from the 2010 census data.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq337",
        "db": "bigquery-public-data.census_bureau_usa\nbigquery-public-data.utility_us",
        "question": "Which ZIP code had the highest percentage change in population between 2000 and 2010?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq023",
        "db": "bigquery-public-data.census_bureau_acs\nbigquery-public-data.fec\nbigquery-public-data.hud_zipcode_crosswalk\nbigquery-public-data.geo_census_tracts",
        "question": "What are the average political donation amounts and median incomes for each census tract identifier in Kings County (Brooklyn), NY, using data from the 2018 ACS and 2020 FEC contributions?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq060",
        "db": "bigquery-public-data.census_bureau_international",
        "question": "Which top 3 countries had the highest net migration in 2017 among those with an area greater than 500 square kilometers? And what are their migration rates?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq338",
        "db": "bigquery-public-data.geo_census_tracts\nbigquery-public-data.geo_us_boundaries\nbigquery-public-data.census_bureau_acs",
        "question": "Which Brooklyn census tract (by geo ID) had the largest increase in median income from 2010 to 2017?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq061",
        "db": "bigquery-public-data.geo_census_tracts\nbigquery-public-data.geo_us_boundaries\nbigquery-public-data.census_bureau_acs",
        "question": "Which census tract has witnessed the largest increase in median income between 2015 and 2018 in California? Tell me the tract code.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq064",
        "db": "bigquery-public-data.geo_census_tracts\nbigquery-public-data.geo_us_boundaries\nbigquery-public-data.census_bureau_acs",
        "question": "Could you calculate the population and average individual income (both rounded to 1 decimal) for each zip code based on U.S. census tract data in 2017? Only include those zip codes within a 5-mile radius of a specific geographic point (47.685833°N, -122.191667°W) in Washington and sort the results according to income in descending order.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq410",
        "db": "bigquery-public-data.geo_us_boundaries\nbigquery-public-data.census_bureau_acs\nspider2-public-data.cyclistic",
        "question": "Please tell me the top three states with the least poeple not in labor force, the amount increase in their total median income from 2015 to 2018, the number of people not in the labor force, and the percentage they represent according to the censustract data in 2015 and 2018.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq198",
        "db": "bigquery-public-data.ncaa_basketball",
        "question": "What are the top 5 most successful college basketball teams over the seasons from 1900 to 2000, based on the number of times they had the maximum wins in a season?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq427",
        "db": "bigquery-public-data.ncaa_basketball",
        "question": "Can you find the average x and y coordinates, the average number of shot attempts, and the average number of successful shots for the most frequent score delta interval in each shot type, considering only shots taken before March 15, 2018, and ensuring that the shots are on the correct side of the court based on the team's basket?",
        "external_knowledge": "basketball.md"
    },
    {
        "instance_id": "bq428",
        "db": "bigquery-public-data.ncaa_basketball",
        "question": "Can you provide the top five team markets with the highest number of distinct players who scored at least 15 points during the second period of games, along with the number of those players, and if there’s a tie, order them alphabetically by team market name?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq274",
        "db": "bigquery-public-data.ncaa_basketball",
        "question": "Can you provide a list that includes details of NCAA basketball tournament games for each season, showing both instances where teams won and lost, including the game's date, day of the week, and how many days have passed since a fixed starting point (epoch)? Please ensure that games where teams won are labeled as 'win' and games where teams lost are labeled as 'loss'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq113",
        "db": "bigquery-public-data.bls_qcew\nbigquery-public-data.bls\nbigquery-public-data.geo_us_boundaries",
        "question": "Which Utah county has witnessed the greatest percentage increase of construction jobs from 2000 to 2018? And what is the corresponding increase rate?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq112",
        "db": "bigquery-public-data.bls_qcew\nbigquery-public-data.bls\nbigquery-public-data.geo_us_boundaries",
        "question": "Did the increase on average annual wages for all industries in Allegheny County, Pittsburgh keep pace with inflation of all consumer items between 1998 and 2017? Tell me their growth rates respectively (2 decimals).",
        "external_knowledge": null
    },
    {
        "instance_id": "bq055",
        "db": "bigquery-public-data.google_dei\nbigquery-public-data.bls\nbigquery-public-data.bls_qcew",
        "question": "Can you provide the top 3 races with the largest percentage differences between Google's 2023 hiring data and the average percentages from the 2022 BLS reports, along with their respective differences?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq055_1",
        "db": "bigquery-public-data.google_dei\nbigquery-public-data.bls\nbigquery-public-data.bls_qcew",
        "question": "What is the total sum of absolute differences in racial representation between Google's 2023 overall hiring data and overall workforce representation across all races?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq055_2",
        "db": "bigquery-public-data.google_dei\nbigquery-public-data.bls\nbigquery-public-data.bls_qcew",
        "question": "Which gender (men or women) has the smallest difference between Google's 2023 overall hiring data and the 2022 average percentages from BLS reports for subsectors like internet publishing, software publishing, and data processing? Please provide the difference as well.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq406",
        "db": "bigquery-public-data.google_dei\nbigquery-public-data.bls\nbigquery-public-data.bls_qcew",
        "question": "Please calculate the growth rates for Asians, Black people, Latinx people, Native Americans, White people, US women, US men, global women, and global men from 2014 to 2024 concerning the overall workforce.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq084",
        "db": "spider2-public-data.goog_blockchain_arbitrum_one_us\nspider2-public-data.goog_blockchain_avalanche_contract_chain_us\nspider2-public-data.goog_blockchain_cronos_mainnet_us\nspider2-public-data.goog_blockchain_ethereum_goerli_us\nspider2-public-data.goog_blockchain_ethereum_mainnet_us\nspider2-public-data.goog_blockchain_fantom_opera_us\nspider2-public-data.goog_blockchain_optimism_mainnet_us\nspider2-public-data.goog_blockchain_polygon_mainnet_us\nspider2-public-data.goog_blockchain_tron_mainnet_us",
        "question": "Please count the monthly transaction numbers and transactions per second for each month in 2023, and arrange them in descending order of monthly transaction count.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq058",
        "db": "spider2-public-data.goog_blockchain_arbitrum_one_us\nspider2-public-data.goog_blockchain_avalanche_contract_chain_us\nspider2-public-data.goog_blockchain_cronos_mainnet_us\nspider2-public-data.goog_blockchain_ethereum_goerli_us\nspider2-public-data.goog_blockchain_ethereum_mainnet_us\nspider2-public-data.goog_blockchain_fantom_opera_us\nspider2-public-data.goog_blockchain_optimism_mainnet_us\nspider2-public-data.goog_blockchain_polygon_mainnet_us\nspider2-public-data.goog_blockchain_tron_mainnet_us",
        "question": "Retrieve all finalized deposits into Optimism at block 29815485 using the Optimism Standard Bridge, including transaction hash, an Etherscan link (the complete URL), L1 and L2 token addresses, sender and receiver addresses (with leading zeroes stripped), and the deposited amount (converted from hex to decimal). Ensure data is properly formatted and parsed according to Optimism's address and token standards. Note that, the keccak-256 hash of the Ethereum event signature for DepositFinalized is \"0x3303facd24627943a92e9dc87cfbb34b15c49b726eec3ad3487c16be9ab8efe8\".",
        "external_knowledge": "optimism_standard_bridge_contract.md"
    },
    {
        "instance_id": "bq416",
        "db": "spider2-public-data.goog_blockchain_arbitrum_one_us\nspider2-public-data.goog_blockchain_avalanche_contract_chain_us\nspider2-public-data.goog_blockchain_cronos_mainnet_us\nspider2-public-data.goog_blockchain_ethereum_goerli_us\nspider2-public-data.goog_blockchain_ethereum_mainnet_us\nspider2-public-data.goog_blockchain_fantom_opera_us\nspider2-public-data.goog_blockchain_optimism_mainnet_us\nspider2-public-data.goog_blockchain_polygon_mainnet_us\nspider2-public-data.goog_blockchain_tron_mainnet_us",
        "question": "Please list the block numbers, source addresses, destination addresses (both in TronLink address format), and transfer amounts for the three largest USDT transactions on the TRON blockchain. The code numbers for USDT contract and transfer event are \"0xa614f803b6fd780986a42c78ec9c7f77e6ded13c\" and \"0xddf252ad1be2c89b69c2b068fc378daa952ba7f163c4a11628f55a4df523b3ef\" respectively.",
        "external_knowledge": "blockchain_data_transformations.md"
    },
    {
        "instance_id": "bq226",
        "db": "spider2-public-data.goog_blockchain_arbitrum_one_us\nspider2-public-data.goog_blockchain_avalanche_contract_chain_us\nspider2-public-data.goog_blockchain_cronos_mainnet_us\nspider2-public-data.goog_blockchain_ethereum_goerli_us\nspider2-public-data.goog_blockchain_ethereum_mainnet_us\nspider2-public-data.goog_blockchain_fantom_opera_us\nspider2-public-data.goog_blockchain_optimism_mainnet_us\nspider2-public-data.goog_blockchain_polygon_mainnet_us\nspider2-public-data.goog_blockchain_tron_mainnet_us",
        "question": "Can you find me the complete url of the most frequently used sender's address on the Cronos blockchain since January 1, 2023, where transactions were made to non-null addresses and in blocks larger than 4096 bytes?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq016",
        "db": "spider2-public-data.deps_dev_v1",
        "question": "Considering only the highest release versions of NPM packages, which one and its version has the most dependent packages?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq062",
        "db": "spider2-public-data.deps_dev_v1",
        "question": "What is the most frequently used license by packages in each system?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq063",
        "db": "spider2-public-data.deps_dev_v1",
        "question": "What is the github URL of the latest released package from the NPM system that have the highest number of dependencies? Exlcude those package whose names contain character '@' or the URL label is not 'SOURCE_REPO'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq028",
        "db": "spider2-public-data.deps_dev_v1",
        "question": "Considering only the latest release versions of NPM package, which packages are the top 3 most popular based on the Github star number, as well as their versions?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq022",
        "db": "bigquery-public-data.chicago_taxi_trips\nbigquery-public-data.chicago_crime",
        "question": "Given the taxi trip data in Chicago, tell me the total number of trips and average fare for each 10-minute interval (using rounded-off minutes) of trip durations no more than 1 hour.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq362",
        "db": "bigquery-public-data.chicago_taxi_trips\nbigquery-public-data.chicago_crime",
        "question": "Which three companies had the largest increase in trip numbers between two consecutive months in 2018?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq363",
        "db": "bigquery-public-data.chicago_taxi_trips\nbigquery-public-data.chicago_crime",
        "question": "For taxi trips with a duration rounded to the nearest minute, and between 1 and 50 minutes, if the trip durations are divided into 10 quantiles, what are the total number of trips and the average fare for each quantile?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq076",
        "db": "bigquery-public-data.chicago_taxi_trips\nbigquery-public-data.chicago_crime",
        "question": "Which month generally has the greatest number of motor vehicle thefts in 2016?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq077",
        "db": "bigquery-public-data.chicago_taxi_trips\nbigquery-public-data.chicago_crime",
        "question": "For each year from 2010 to 2016, what is the highest number of motor thefts in one month?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq350",
        "db": "open-targets-prod.platform",
        "question": "Please display the drug id, drug type and withdrawal status for approved drugs with a black box warning and known drug type among 'Keytruda', 'Vioxx', 'Premarin', and 'Humira'",
        "external_knowledge": null
    },
    {
        "instance_id": "bq351_1",
        "db": "open-targets-prod.platform",
        "question": "Which target approved symbol has the overall association score closest to the mean score for psoriasis?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq078",
        "db": "bigquery-public-data.open_targets_platform",
        "question": "Retrieve the approved symbol of target genes with the highest overall score that are associated with the disease 'EFO_0000676' from the data source 'IMPC'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq079_1",
        "db": "open-targets-prod.platform",
        "question": "Please generate a list of drugs that have completed clinical trials for pancreatic endocrine carcinoma based on ChEMBL database, including drug name, target approved symbol and links to the supporting clinical trials. The disease ID of pancreatic endocrine carcinoma is EFO_0007416.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq109",
        "db": "open-targets-genetics.genetics",
        "question": "Find the average, variance, max-min difference, and the QTL source(right study) of the maximum log2(h4/h3) for data where right gene id is \"ENSG00000169174\", h4 > 0.8, h3 < 0.02, reported trait includes \"lesterol levels\", right biological feature is \"IPSC\", and the variant is '1_55029009_C_T'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq083",
        "db": "spider2-public-data.crypto_ethereum",
        "question": "What is the daily change in the total market value (formatted in USD) of the USDC token (with a target address of \"0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48\") in 2023 , considering both Mint (the input starts with 0x42966c68) and Burn (the input starts with 0x40c10f19) transactions?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq325",
        "db": "bigquery-public-data.open_targets_genetics",
        "question": "What are the top 10 genes with the lowest p-values across studies?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq090",
        "db": "bigquery-public-data.cymbal_investments",
        "question": "How much higher the average intrinsic value is for trades using the feeling-lucky strategy compared to those using the momentum strategy under long-side trades?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq024_1",
        "db": "bigquery-public-data.usfs_fia",
        "question": "Please identify the top ten states with the smallest total acreage in their latest evaluation group by calculating the sum of macroplot and subplot acres in the timberland acres data, and display the state code, evaluation group, state name, total acres, sorted in the order of increasing total acres. Note the evaluation groups are numbered in chronological order, with higher numbers representing more recent data.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq220",
        "db": "bigquery-public-data.usfs_fia",
        "question": "Which two states respectively had the largest average subplot size and the largest average macroplot size in 2017  based on accessible forest land and current evaluations (EXPCURR)? Display each state along with its corresponding average subplot or macroplot size.",
        "external_knowledge": "subplot_macroplot_size.md"
    },
    {
        "instance_id": "bq096",
        "db": "bigquery-public-data.gbif",
        "question": "Which year had the earliest occurrence of a day with more than 10 sightings of the Sterna paradisaea north of 40 degrees latitude, after January?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq276",
        "db": "bigquery-public-data.persistent_udfs\nbigquery-public-data.geo_international_ports\nbigquery-public-data.geo_us_boundaries\nbigquery-public-data.geo_us_roads\nbigquery-public-data.noaa_hurricanes",
        "question": "Can you provide me with the details of the port that has been affected by the highest average wind speed of tropical storms in region number 6585 including the port name, storm name and the average storm category? Only consider named storms in the North Atlantic basin with wind speeds of at least 35 knots and at least a minimal tropical storm strength on the SSHS scale. Also, ensure that this port is located within a U.S. state boundary.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq277",
        "db": "bigquery-public-data.persistent_udfs\nbigquery-public-data.geo_international_ports\nbigquery-public-data.geo_us_boundaries\nbigquery-public-data.geo_us_roads\nbigquery-public-data.noaa_hurricanes",
        "question": "Can you provide the name of the port that is most frequently within the geographical area of named tropical storms in the region of the code ‘6585’ with winds of at least 35 knots in the North Atlantic basin, which is also located within a specific region and intersects with interstate roads?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq278",
        "db": "bigquery-public-data.sunroof_solar",
        "question": "Please provide me with details about the state that has the highest number of buildings suitable for solar installations according to Google Maps data, including the state name, percent of buildings in Google Maps covered by Project Sunroof, total solar energy generation potential and potential carbon dioxide abatement.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq102",
        "db": "bigquery-public-data.gnomAD",
        "question": "Identify which start positions are associated with missense variants in the BRCA1 gene on chromosome 17, where the reference base is 'C' and the alternate base is 'T'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq104",
        "db": "bigquery-public-data.google_trends",
        "question": "Identify which DMA had the highest search scores for the terms that were top rising one year ago",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq411",
        "db": "bigquery-public-data.google_trends",
        "question": "Please identify the top two Google Trends search terms for each weekday over the first two weeks in Sept. 2024, and list them by date from most recent to oldest.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq105",
        "db": "bigquery-public-data.nhtsa_traffic_fatalities\nbigquery-public-data.census_bureau_usa\nbigquery-public-data.utility_us",
        "question": "How many traffic accidents per 100,000 people, specifically attributed to driver distraction, occurred in each state in 2015? Please consider only those incidents where the driver was confirmed to be distracted, excluding cases categorized as \"Not Distracted,\" \"Unknown if Distracted,\" or \"Not Reported.\" Note that the population data used for this analysis is from 2010.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq108",
        "db": "bigquery-public-data.nhtsa_traffic_fatalities",
        "question": "Calculate the percentage of 2016 traffic accidents involving multiple severe injuries (injury severity 4) from January to August",
        "external_knowledge": null
    },
    {
        "instance_id": "bq067",
        "db": "bigquery-public-data.nhtsa_traffic_fatalities",
        "question": "I want to build a ML model which can predict whether there will be more than one fatality in a crash invloving 2 or more people. Construct a labelled (0 or 1) dataset for me, and the predictors include the state, vehicle type, the number of drunk drivers, day of the week, hour of the day and another two engineered features, whether the accident happened in the work zone and the average absolute difference between travel speed and speed limit. Please use numeric value for each predictor and categorize the speed difference into levels 0 to 4 based on 20MPH increments (lower bound inclusive while upper exclusive).",
        "external_knowledge": "nhtsa_traffic_fatalities.md"
    },
    {
        "instance_id": "bq396",
        "db": "bigquery-public-data.nhtsa_traffic_fatalities",
        "question": "Which top 3 states had the largest differences in the number of traffic accidents between rainy and clear weather during weekends in 2016? Please also provide the respective differences for each state.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq110",
        "db": "bigquery-public-data.sdoh_bea_cainc30\nbigquery-public-data.sdoh_cdc_wonder_natality\nbigquery-public-data.sdoh_cms_dual_eligible_enrollment\nbigquery-public-data.sdoh_hrsa_shortage_areas\nbigquery-public-data.sdoh_hud_housing\nbigquery-public-data.sdoh_hud_pit_homelessness\nbigquery-public-data.sdoh_snap_enrollment\nbigquery-public-data.census_bureau_acs",
        "question": "What has been the change in the number of homeless veterans in each CoC region of New York between 2012 and 2018?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq395",
        "db": "bigquery-public-data.sdoh_bea_cainc30\nbigquery-public-data.sdoh_cdc_wonder_natality\nbigquery-public-data.sdoh_cms_dual_eligible_enrollment\nbigquery-public-data.sdoh_hrsa_shortage_areas\nbigquery-public-data.sdoh_hud_housing\nbigquery-public-data.sdoh_hud_pit_homelessness\nbigquery-public-data.sdoh_snap_enrollment\nbigquery-public-data.census_bureau_acs",
        "question": "Which 5 states' percentage change in unsheltered homeless individuals from 2015 to 2018 were top 5 closest to the national average? Please provide the state abbreviation.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq352",
        "db": "bigquery-public-data.sdoh_bea_cainc30\nbigquery-public-data.sdoh_cdc_wonder_natality\nbigquery-public-data.sdoh_cms_dual_eligible_enrollment\nbigquery-public-data.sdoh_hrsa_shortage_areas\nbigquery-public-data.sdoh_hud_housing\nbigquery-public-data.sdoh_hud_pit_homelessness\nbigquery-public-data.sdoh_snap_enrollment\nbigquery-public-data.census_bureau_acs",
        "question": "Please list the average number of prenatal weeks in 2018 for counties in Wisconsin where more than 5% of the employed population had commutes of 45-59 minutes in 2017.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq352_1",
        "db": "bigquery-public-data.sdoh_bea_cainc30\nbigquery-public-data.sdoh_cdc_wonder_natality\nbigquery-public-data.sdoh_cms_dual_eligible_enrollment\nbigquery-public-data.sdoh_hrsa_shortage_areas\nbigquery-public-data.sdoh_hud_housing\nbigquery-public-data.sdoh_hud_pit_homelessness\nbigquery-public-data.sdoh_snap_enrollment\nbigquery-public-data.census_bureau_acs",
        "question": "How much higher is the average percentage of employees commuting between 45 and 59 minutes in 2017 among the top three Wisconsin counties with the highest average prenatal weeks in 2018, compared to that in the bottom three counties?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq074",
        "db": "bigquery-public-data.sdoh_bea_cainc30\nbigquery-public-data.sdoh_cdc_wonder_natality\nbigquery-public-data.sdoh_cms_dual_eligible_enrollment\nbigquery-public-data.sdoh_hrsa_shortage_areas\nbigquery-public-data.sdoh_hud_housing\nbigquery-public-data.sdoh_hud_pit_homelessness\nbigquery-public-data.sdoh_snap_enrollment\nbigquery-public-data.census_bureau_acs",
        "question": "How many counties experienced an increase in unemployment between 2015 and 2018, and a decrease in dual-eligible enrollee counts between 2015-12-01 and 2018-12-01?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq066",
        "db": "bigquery-public-data.sdoh_bea_cainc30\nbigquery-public-data.sdoh_cdc_wonder_natality\nbigquery-public-data.sdoh_cms_dual_eligible_enrollment\nbigquery-public-data.sdoh_hrsa_shortage_areas\nbigquery-public-data.sdoh_hud_housing\nbigquery-public-data.sdoh_hud_pit_homelessness\nbigquery-public-data.sdoh_snap_enrollment\nbigquery-public-data.census_bureau_acs",
        "question": "Could you assess the relationship between poverty rates in 2017 and the percentage of births without maternal morbidity in 2018 by computing their Pearson correlation coefficient?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq114",
        "db": "bigquery-public-data.openaq\nbigquery-public-data.epa_historical_air_quality",
        "question": "What are the top two cities with the largest difference values between the 1990 EPA PM2.5 annual mean and the 2020 PM2.5 values?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq116",
        "db": "bigquery-public-data.sec_quarterly_financials",
        "question": "What was the highest annual revenue in billions of dollars reported by a U.S. state in 2016, across the main revenue categories and covering all four quarters?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq015",
        "db": "bigquery-public-data.stackoverflow\nfh-bigquery.hackernews",
        "question": "Rank the top 10 most discussed tags on Stack Overflow questions that were mentioned on Hacker News since 2014.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq041",
        "db": "bigquery-public-data.stackoverflow",
        "question": "What are the monthly statistics for new StackOverflow users created in 2021, including the percentage of new users who asked questions and the percentage of those who asked questions and then answered questions within their first 30 days?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq121",
        "db": "bigquery-public-data.stackoverflow",
        "question": "How does average reputation and badge count vary among Stack Overflow users based on their tenure, measured in years?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq123",
        "db": "bigquery-public-data.stackoverflow",
        "question": "Which day of the week has the third highest percentage of questions answered within an hour?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq280",
        "db": "bigquery-public-data.stackoverflow",
        "question": "Please provide the display name of the user who has answered the most questions on Stack Overflow, considering only users with a reputation greater than 10.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq300",
        "db": "bigquery-public-data.stackoverflow",
        "question": "What is the highest number of answers received for a single Python 2 specific question on Stack Overflow, excluding any discussions that involve Python 3?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq301",
        "db": "bigquery-public-data.stackoverflow",
        "question": "Retrieve details of accepted answers related to JavaScript security topics such as XSS, cross-site scripting, exploits, and cybersecurity, for questions posted in January 2016 on Stack Overflow. For each accepted answer, include the answer's ID, the answerer's reputation, score, and comment count, along with the associated question's tags, score, answer count, the asker's reputation, view count, and comment count.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq302",
        "db": "bigquery-public-data.stackoverflow",
        "question": "What is the monthly proportion of Stack Overflow questions tagged with 'python' in the year 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq303",
        "db": "bigquery-public-data.stackoverflow",
        "question": "What are the user IDs and tags for comments, answers, and questions posted by users with IDs between 16712208 and 18712208 on Stack Overflow during July to December 2019?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq304",
        "db": "bigquery-public-data.stackoverflow",
        "question": "What are the top 50 most viewed 'how-to' questions for each of the following Android-related tags on StackOverflow: 'android-layout', 'android-activity', 'android-intent', 'android-edittext', 'android-fragments', 'android-recyclerview', 'listview', 'android-actionbar', 'google-maps', and 'android-asynctask'? Ensure that each tag has at least 50 questions and exclude any questions containing terms typically associated with troubleshooting, such as 'fail', 'problem', 'error', 'wrong', 'fix', 'bug', 'issue', 'solve', or 'trouble'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq304_1",
        "db": "bigquery-public-data.stackoverflow",
        "question": "What is the title of the most viewed \"how-to\" question related to Android development on StackOverflow, across specified tags such as 'android-layout', 'android-activity', 'android-intent', and others",
        "external_knowledge": null
    },
    {
        "instance_id": "bq305",
        "db": "bigquery-public-data.stackoverflow",
        "question": "Identify the top 10 users by the total view count of their associated questions. Include users who own a question, provide an accepted answer, have an answer with a score above 5, rank in the top 3 for a question, or have an answer with a score over 20% of the total answer score for that question. Use these criteria to determine the questions and answers to include in the view count calculation.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq306",
        "db": "bigquery-public-data.stackoverflow",
        "question": "Identify the top 10 tags for user 1908967 by calculating a reputation score based on upvotes and accepted answers before June 7, 2018. The score is calculated as 10 times the upvotes plus 15 times the accepted answers.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq307",
        "db": "bigquery-public-data.stackoverflow",
        "question": "Find the top 10 most common first gold badges on Stack Overflow, showing how many users earned each and the average days from account creation to earning the badge.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq308",
        "db": "bigquery-public-data.stackoverflow",
        "question": "Show the number of Stack Overflow questions asked each day of the week in 2020, and find out how many and what percentage of those were answered within one hour.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq309",
        "db": "bigquery-public-data.stackoverflow",
        "question": "Show the top 10 longest Stack Overflow questions where the question has an accepted answer or an answer with a score-to-view ratio above 0.01, including the user's reputation, net votes, and badge count.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq124",
        "db": "bigquery-public-data.fhir_synthea",
        "question": "Can you identify how many alive patients, currently managing chronic conditions such as diabetes or hypertension, are prescribed seven or more medications?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq391",
        "db": "bigquery-public-data.fhir_synthea",
        "question": "What are the condition and code for living patients whose last name starts with \"A\" and have the highest medication count, considering only those with exactly one condition and active medications?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq126",
        "db": "bigquery-public-data.the_met",
        "question": "What are the titles, artist names, mediums, and original image URLs of objects with 'Photograph' in their names from the 'Photographs' department, created by known artists, with an object end date of 1839 or earlier?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq366",
        "db": "bigquery-public-data.the_met",
        "question": "What are the top three most frequently associated labels with artworks from each historical period in The Met's collection, only considering labels linked to 50 or more artworks? Provide me with the period, label, and the associated count.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq414",
        "db": "bigquery-public-data.the_met",
        "question": "Retrieve the object id, title, and the formatted metadata date (as a string in 'YYYY-MM-DD' format) for objects in the \"The Libraries\" department where the cropConfidence is greater than 0.5, the object's title contains the word \"book\".",
        "external_knowledge": null
    },
    {
        "instance_id": "bq200",
        "db": "bigquery-public-data.baseball",
        "question": "Can you find the full name of the fastest pitcher on each team by maximum pitch speed, using both regular and post-season data?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq204",
        "db": "bigquery-public-data.eclipse_megamovie",
        "question": "Find the user with the highest total clicks across all records from all available photo collections.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq389",
        "db": "bigquery-public-data.epa_historical_air_quality",
        "question": "Please calculate the monthly average levels of PM10, PM2.5 FRM, PM2.5 non-FRM, CO, SO2 (scaled by a factor of 10), and Lead (scaled by a factor of 100) air pollutants in California for the year 2020.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq344",
        "db": "spider2-public-data.idc_v17",
        "question": "What is the largest total size in tebibytes of DICOM collections that include SEG or RTSTRUCT modalities?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq345",
        "db": "spider2-public-data.idc_v17",
        "question": "How many distinct DICOM collections with SEG modality images and SOP Class UID of \"1.2.840.10008.5.1.4.1.1.66.4\" have no referenced series, referenced images, or source images?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq346",
        "db": "spider2-public-data.idc_v17",
        "question": "Which five segmentation categories appear most frequently in publicly accessible DICOM SEG data, where the modality is \"SEG\" and the SOPClassUID is \"1.2.840.10008.5.1.4.1.1.66.4\"?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq347",
        "db": "spider2-public-data.idc_v17",
        "question": "Which modality has the highest count of SOP instances, including MR series with SeriesInstanceUID = \"1.3.6.1.4.1.14519.5.2.1.3671.4754.105976129314091491952445656147\" and all associated segmentation data, along with the total count of instances?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq390",
        "db": "spider2-public-data.idc_v17",
        "question": "Please provide the study instance UIDs for studies that include both T2-weighted axial magnetic resonance imaging and anatomical structure segmentations of the peripheral zone, in prostate repeatability collection.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq421",
        "db": "spider2-public-data.idc_v17",
        "question": "Can you find the most frequent staining substance used for the most commonly occurring embedding medium, based on distinct embedding medium and staining substance codes from the 'SM' modality in the DICOM dataset's un-nested specimen preparation sequences, ensuring that the codes are from the SCT coding scheme?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq422",
        "db": "spider2-public-data.idc_v17",
        "question": "What are the average series sizes in MiB for the top 3 patients with the highest slice interval difference tolerance and the top 3 patients with the highest maximum exposure difference, considering only CT images from the 'nlst' collection?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq069",
        "db": "spider2-public-data.idc_v17",
        "question": "Could you help me generate a CT Image Series report which excludes the NLST study and those do not conform to some geometrical checks, also filter out those series that require additional decompression steps before passing to dcm2niix for conversion to NIFTI format. The detailed assumptions and requirements are provided in `nonNlstCohort.md`.",
        "external_knowledge": "nonNlstCohort.md"
    },
    {
        "instance_id": "bq219",
        "db": "bigquery-public-data.iowa_liquor_sales",
        "question": "Which two liquor categories, each contributing an average of at least 1% to monthly sales volume over 24 months, have the lowest Pearson correlation coefficient in their sales percentages?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq199",
        "db": "bigquery-public-data.iowa_liquor_sales",
        "question": "Identify the top 10 liquor categories in Iowa by average price per liter in 2021, and provide their average prices per liter for 2019, 2020, and 2021.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq218",
        "db": "bigquery-public-data.iowa_liquor_sales",
        "question": "What are the top 5 items with the highest year-over-year growth percentage in total sales revenue for the year 2023?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq049",
        "db": "bigquery-public-data.census_bureau_usa\nbigquery-public-data.iowa_liquor_sales",
        "question": "Display the monthly per capita Bourbon Whiskey sales in 2022 for the zip code with the second-highest total sales in Dubuque County, considering only the population aged 21 and over.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq360",
        "db": "bigquery-public-data.nppes",
        "question": "Which of the top 10 most common healthcare provider specializations in Mountain View, CA, has a specialist count closest to the average of these ten specializations?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq286",
        "db": "bigquery-public-data.usa_names",
        "question": "Can you tell me the name of the most popular female baby in Wyoming for the year 2021, based on the proportion of female babies given that name compared to the total number of female babies given the same name across all states?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq044",
        "db": "spider2-public-data.TCGA_versioned",
        "question": "For bladder cancer patients who have mutations in the CDKN2A (cyclin-dependent kinase inhibitor 2A) gene, using clinical data from the Genomic Data Commons Release 39, what types of mutations are they, what is their gender, vital status, and days to death - and for four downstream genes (MDM2 (MDM2 proto-oncogene), TP53 (tumor protein p53), CDKN1A (cyclin-dependent kinase inhibitor 1A), and CCNE1 (Cyclin E1)), what are the gene expression levels for each patient?",
        "external_knowledge": "TCGA_Study_Abbreviations.md"
    },
    {
        "instance_id": "bq043",
        "db": "spider2-public-data.TCGA_versioned",
        "question": "What are the RNA expression levels of the genes MDM2, TP53, CDKN1A, and CCNE1, along with associated clinical information, in bladder cancer patients with CDKN2A mutations in the 'TCGA-BLCA' project?  using clinical data from the Genomic Data Commons Release 39.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq147",
        "db": "spider2-public-data.TCGA_versioned",
        "question": "Can you find which TCGA breast cancer cases include both normal and other types of tissue samples, focusing on protein-coding genes?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq148",
        "db": "spider2-public-data.TCGA_versioned",
        "question": "Could you list the top five protein-coding genes with the highest expression variability in 'Solid Tissue Normal' samples from multi-tissue TCGA-BRCA cases?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq166_1",
        "db": "spider2-public-data.TCGA_versioned\nmitelman-db.prod",
        "question": "Identify cytoband names on chromosome 1 in the TCGA-KIRC segment allelic dataset where the frequency of amplifications, gains, and heterozygous deletions each rank within the top 11. Calculate these rankings based on the maximum copy number observed across various genomic studies of kidney cancer, reflecting the severity of genetic alterations.",
        "external_knowledge": "Comprehensive_Guide_to_Copy_Number_Variations_in_Cancer_Genomics.md"
    },
    {
        "instance_id": "bq168_1",
        "db": "spider2-public-data.TCGA_versioned\nmitelman-db.prod",
        "question": "Identify the case barcodes from the TCGA-LAML study with the highest weighted average copy number in cytoband 15q11 on chromosome 15, using segment data and cytoband overlaps from TCGA's genomic and Mitelman databases.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq170",
        "db": "spider2-public-data.TCGA_versioned\nmitelman-db.prod",
        "question": "For breast cancer cases (TCGA-BRCA) from REL 23 of the active GDC archive, identify and categorize copy number variations (CNVs) across different cytobands on all chromosomes. CNVs include amplifications, gains, homozygous deletions, heterozygous deletions, and normal diploid states. For each cytoband, tell me its name and start/end position, and calculate the frequency of each CNV type as a percentage of the total number of cases (rounded to 2 decimals).",
        "external_knowledge": "copy_number_variations.md"
    },
    {
        "instance_id": "bq418",
        "db": "isb-cgc-bq.targetome_versioned\nisb-cgc-bq.reactome_versioned",
        "question": "What are the counts of targets and non-targets within and outside the top 3 pathways with the highest chi-squared statistic for human targets associated with 'sorafenib'? The targets should meet specific assay conditions (median assay value ≤ 100, with assay values below and above also ≤ 100 or NULL if not applicable), and only pathways with TAS evidence at the lowest level should be considered.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq150",
        "db": "spider2-public-data.TCGA_hg19_data_v0",
        "question": "Do different genetic variants impact log10-transformed TP53 expression levels in TCGA-BRCA samples based on sequencing and mutation data? Show me the total sample count, the number of mutation types, the mean square between groups, the mean square within groups, and the F-statistic.",
        "external_knowledge": "TCGA_F_Score.md"
    },
    {
        "instance_id": "bq152",
        "db": "spider2-public-data.TCGA_hg38_data_v0\nisb-cgc.TCGA_bioclin_v0\nisb-cgc.QotM",
        "question": "Identify the top five biological pathways exhibiting the most significant changes in gene expression among TCGA-UCEC samples, specifically comparing those with non-synonymous mutations in the PARP1 gene to those without. This analysis should utilize log10-transformed gene expression data and apply t-statistics to assess the differences in expression levels across the pathways.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq155",
        "db": "spider2-public-data.TCGA_hg38_data_v0\nisb-cgc.TCGA_bioclin_v0\nisb-cgc.QotM",
        "question": "Help me calculate the t-statistic based on the Pearson correlation coefficient between all possible pairs of gene `SNORA31` in the RNAseq data (Log10 transformation) and unique identifiers in the microRNA data available in TCGA. The cohort for this analysis consists of BRCA patients that are 80 years old or younger at the time of diagnosis and Stage I,II,IIA as pathological state. And only consider samples of size more than 25 and with absolute Pearson correlation at least 0.3, and less than 1.0.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq046",
        "db": "isb-cgc.TCGA_bioclin_v0\nisb-cgc.GDC_metadata",
        "question": "Find case barcodes and their corresponding GDC file URLs for female patients aged 30 or younger diagnosed with breast cancer, whose clinical history includes problematic prior treatments for other cancers or redacted annotations. Only consider relevant clinical and annotation data from TCGA with GDC archive release 14.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq153",
        "db": "spider2-public-data.pancancer_atlas_filtered",
        "question": "What is the average log-transformed expression level of the IGF2 gene for each histology type in LGG patients?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq154",
        "db": "spider2-public-data.pancancer_atlas_filtered",
        "question": "What is the heterogeneity score (H-score) among groups of LGG patients, where the IGF2 gene expression is calculated by first applying a log10 transformation to the normalized counts, then averaging them, and the groups are based on ICD-O-3 histology codes?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq156",
        "db": "spider2-public-data.pancancer_atlas_filtered",
        "question": "Compute the t-score (rounded to 2 decimals) to compare the difference in mean expression levels of gene DRG2 between two groups (TP53 mutated vs. non-mutated) in the Lower Grade Glioma study. Note that, categorical groups with number of samples smaller than 10 or zero variance should be ignored. Refer to `t_score.md` about how to compute t-score.",
        "external_knowledge": "t_score.md"
    },
    {
        "instance_id": "bq157",
        "db": "spider2-public-data.pancancer_atlas_filtered",
        "question": "Please help me compute the T score to show the statistical difference in the expression of the DRG2 gene between LGG patients with and without TP53 mutation, based on the logarithm of normalized gene counts, averaged across patients.",
        "external_knowledge": "Regulome Explorer T test for numerical and binary data.md"
    },
    {
        "instance_id": "bq158",
        "db": "spider2-public-data.pancancer_atlas_filtered",
        "question": "What histological type of breast cancer (BRCA) has the highest percentage of CDH1 gene mutations, according to the data in the PanCancer Atlas?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq159",
        "db": "spider2-public-data.pancancer_atlas_filtered",
        "question": "What is the chi-square value for the association between histological types and the presence of CDH1 gene mutations in BRCA patients, according to the PanCancer Atlas?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq161",
        "db": "isb-cgc-bq.pancancer_atlas",
        "question": "Calculate the net difference between the number of pancreatic adenocarcinoma (PAAD) patients in TCGA's dataset who are confirmed to have mutations in both KRAS and TP53 genes, and those without mutations in either gene. Utilize patient clinical and follow-up data alongside genomic mutation details from TCGA’s cancer genomics database, focusing specifically on PAAD studies where the mutations have passed quality filters.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq161_1",
        "db": "isb-cgc-bq.pancancer_atlas",
        "question": "Calculate the chi-squared statistic to determine the association between KRAS and TP53 mutations in pancreatic adenocarcinoma (PAAD) patients. Use TCGA’s clinical follow-up data along with detailed mutation annotations from genomic studies to compare the occurrence of simultaneous mutations in both genes against their absence. This statistical assessment aims to reveal potential correlations between these genetic alterations in the PAAD patient cohort.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq162",
        "db": "isb-cgc-bq.HTAN_versioned",
        "question": "What are the different imaging assay types and their respective data levels available at the HTAN WUSTL center as per the 5th revision (r5) of the HTAN data? Each assay may include one or more of the following data levels: Level1, Level2, Level3, Level4. ",
        "external_knowledge": null
    },
    {
        "instance_id": "bq163",
        "db": "spider2-public-data.HTAN",
        "question": "Identify the top 20 genes with the largest expression differences between male and female 74-year-old epithelial cells in cluster 41 from MSK-SCLC patients",
        "external_knowledge": null
    },
    {
        "instance_id": "bq164",
        "db": "spider2-public-data.HTAN",
        "question": "Consolidate metadata from spatial transcriptomics and scRNAseq (including auxiliary files) for the run ID 'HT264P1-S1H2Fc2U1Z1Bs1-H2Bs2-Test', including file names, biospecimen identifiers, data components, file formats, entity IDs, and run identifiers.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq165",
        "db": "mitelman-db.prod",
        "question": "Can you use CytoConverter genomic coordinates to calculate the frequency of chromosomal gains and losses across a cohort of breast cancer (morphology='3111') and adenocarcinoma (topology='0401') samples? Concretely, please include the number and frequency (2 decimals in percentage) of amplifications (gains of more than 1 copy), gains (1 extra copy), losses (1 copy) and homozygous deletions (loss of 2 copies) for each chromosomal band. And sort the result by the ordinal of each chromosome and the starting-ending base-pair position of each band in ascending order.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq169",
        "db": "mitelman-db.prod",
        "question": "For cases in which:\n- Chromosome 13 has a loss of genetic material between positions 48,303,751 and 48,481,890,\n- Chromosome 17 has a loss of genetic material between positions 7,668,421 and 7,687,490, and\n- Chromosome 11 has a gain of genetic material between positions 108,223,067 and 108,369,102,\nretrieve the case information where all three conditions above are met. For each case, also return the chromosomal details for each region (chromosome number, start and end positions) and the corresponding karyotype information.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq415",
        "db": "spider2-public-data.human_genome_variants",
        "question": "List the samples in the genome data that rank in the top 5 for the number of homozygous reference genotypes, considering only the primary reference allele, ordered in descending sequence.",
        "external_knowledge": "Homozygous_Reference_Genotype.md"
    },
    {
        "instance_id": "bq279",
        "db": "bigquery-public-data.austin_bikeshare\nbigquery-public-data.austin_311\nbigquery-public-data.austin_crime\nbigquery-public-data.austin_incidents\nbigquery-public-data.austin_waste",
        "question": "Can you provide the number of distinct active and closed bike share stations for each year 2013 and 2014 in a chronological view?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq281",
        "db": "bigquery-public-data.austin_bikeshare\nbigquery-public-data.austin_311\nbigquery-public-data.austin_crime\nbigquery-public-data.austin_incidents\nbigquery-public-data.austin_waste",
        "question": "What is the highest number of electric bike rides lasting more than 10 minutes taken by subscribers with 'Student Membership' in a single day, excluding rides starting or ending at 'Mobile Station' or 'Repair Shop'?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq282",
        "db": "bigquery-public-data.austin_bikeshare\nbigquery-public-data.austin_311\nbigquery-public-data.austin_crime\nbigquery-public-data.austin_incidents\nbigquery-public-data.austin_waste",
        "question": "Can you tell me the numeric value of the active council district in Austin which has the highest number of bike trips that start and end within the same district, but not at the same station?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq283",
        "db": "bigquery-public-data.austin_bikeshare\nbigquery-public-data.austin_311\nbigquery-public-data.austin_crime\nbigquery-public-data.austin_incidents\nbigquery-public-data.austin_waste",
        "question": "What is the combined percentage of all bike trips that start from the top 15 most used active stations in Austin?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq329",
        "db": "bigquery-public-data.austin_bikeshare\nbigquery-public-data.austin_311\nbigquery-public-data.austin_crime\nbigquery-public-data.austin_incidents\nbigquery-public-data.austin_waste",
        "question": "Which bike station in the Austin bikeshare system has the lowest average trip duration? I want the station ID.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq006",
        "db": "bigquery-public-data.austin_bikeshare\nbigquery-public-data.austin_311\nbigquery-public-data.austin_crime\nbigquery-public-data.austin_incidents\nbigquery-public-data.austin_waste",
        "question": "What is the date with the second highest Z-score for daily counts of 'PUBLIC INTOXICATION' incidents in Austin for the year 2016? List the date in the format of '2016-xx-xx'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq284",
        "db": "bigquery-public-data.bbc_news",
        "question": "Can you provide a breakdown of the total number of articles into different categories and the percentage of those articles that mention \"Education\" within each category (tech, sport, business, politics, and entertainment) from the BBC News dataset?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq413",
        "db": "bigquery-public-data.dimensions_ai_covid19",
        "question": "Retrieve the venue titles of publications inserted from 2024 onwards, where the associated grid's city is 'Qianjiang', prioritizing the venue titles from journal first, then proceedings, book, or book series titles.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq425",
        "db": "bigquery-public-data.ebi_chembl",
        "question": "List all distinct molecules associated with the company 'SanofiAventis,' along with their trade name and approval date, retaining the most recent approval date for each molecule, using data from ChEMBL Release 23.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq285",
        "db": "bigquery-public-data.fdic_banks",
        "question": "Could you provide me with the zip code of the location that has the highest number of bank institutions in Florida?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq288",
        "db": "bigquery-public-data.fdic_banks",
        "question": "Could you tell me the number of banking institutions in the state with the highest total assets for banks established between 1900 and 2000 (both included) and its name starting with \"Bank\"?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq330",
        "db": "bigquery-public-data.fdic_banks\nbigquery-public-data.census_utility\nbigquery-public-data.geo_census_blockgroups\nbigquery-public-data.geo_us_boundaries",
        "question": "What is the zip code in Colorado with the highest number of bank locations per block group?",
        "external_knowledge": "overlap_ratio.md"
    },
    {
        "instance_id": "bq287",
        "db": "bigquery-public-data.fdic_banks\nbigquery-public-data.census_bureau_acs",
        "question": "What is the employment rate (only consider population over 16) in the Utah zip code that has the fewest number of bank locations based on American Community Survey data in 2017?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq412",
        "db": "spider2-public-data.google_ads_transparency_center",
        "question": "Please provide the page URLs, first shown time, last shown time, removal reason, violation category, and lower and upper bound shown times for the most recent five closed ads in the Croatia region which had shown higher than 10,000 and lower than 25,000, and used at least one audience criterion such as demographics, geographic location, contextual signals, customer lists, or interest topics. The region code of Croatia is HR.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq423",
        "db": "spider2-public-data.google_ads_transparency_center",
        "question": "Please provide the page URL of the image-type ad published by advertisers from region CY, on the topic of health, that has the highest upper bound of times shown. This ad should have demographic information, geo location, contextual signals, customer lists, and topics of interest. The ad should be shown in region Croatia (region code HR) and must have been displayed between January 1, 2023, and January 1, 2024. Additionally, the advertiser must be verified.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq070",
        "db": "spider2-public-data.idc_v17",
        "question": "Could you construct a structured clean dataset from `dicom_all` for me? It should retrieve digital slide microscopy (SM) images from the TCGA-LUAD and TCGA-LUSC datasets and meet the requirements in `dicom_dataset_selection.md`. The target labels are tissue type and cancer subtype.",
        "external_knowledge": "dicom_dataset_selection.md"
    },
    {
        "instance_id": "bq320",
        "db": "spider2-public-data.idc_v17",
        "question": "What is the total count of StudyInstanceUIDs that have a segmented property type of '15825003' and belong to the 'Community' or 'nsclc_radiomics' collections?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq321",
        "db": "spider2-public-data.idc_v17",
        "question": "How many unique StudyInstanceUIDs are there from the DWI, T2 Weighted Axial, Apparent Diffusion Coefficient series, and T2 Weighted Axial Segmentations in the 'qin_prostate_repeatability' collection?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq323",
        "db": "spider2-public-data.idc_v17",
        "question": "What is the total average of Repetition Time, Echo Time, and Slice Thickness for MRI sequences labeled as t2w_prostateX (when the series description contains t2_tse_tra) and adc_prostateX (when the series description contains ADC) within the prostatex collection, ensuring the modality is MR?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq417",
        "db": "spider2-public-data.idc_v17",
        "question": "Please provide the patient ID, series instance UID, study instance UID, study description, modality, number of instances, storage path in ASW and total size (in megabytes) of medical images for 18-year-old male patients examined in mediastinum with a CC BY 3.0 license, after September 1, 2014.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq324",
        "db": "spider2-public-data.idc_v17",
        "question": "What is the total number of frames for whole slide microscopy images categorized under the 'TCGA-BRCA' collection that contain eosin staining during specimen preparation steps?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq227_1",
        "db": "bigquery-public-data.london_crime\nbigquery-public-data.london_fire_brigade",
        "question": "Could you provide the annual percentage share of the total crime committed by the top 5 minor crime categories in London year by year?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq227_2",
        "db": "bigquery-public-data.london_crime\nbigquery-public-data.london_fire_brigade",
        "question": "Could you provide the total number of 'Other Theft' incidents within the 'Theft and Handling' category for each year in the Westminster borough?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq228",
        "db": "bigquery-public-data.london_crime\nbigquery-public-data.london_fire_brigade",
        "question": "Please provide a list of the top three major crime categories in the borough of Barking and Dagenham, along with the number of incidents in each category.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq229",
        "db": "bigquery-public-data.open_images",
        "question": "Can you provide a count of how many image URLs are categorized as ‘cat’ (with label '/m/01yrx' and full confidence) and how many contain no such cat labels(categorized as ‘other’) at all? ",
        "external_knowledge": null
    },
    {
        "instance_id": "bq230",
        "db": "bigquery-public-data.usda_nass_agriculture",
        "question": "Can you provide the maximum amount of corn produced (measured in bushels) by each state in the year 2018, listing the results by state name?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq231",
        "db": "bigquery-public-data.usda_nass_agriculture",
        "question": "Which state produced the most mushrooms in the year 2022 according to the horticulture production statistics?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq326",
        "db": "bigquery-public-data.world_bank_intl_debt\nbigquery-public-data.world_bank_wdi\nbigquery-public-data.world_bank_intl_education\nbigquery-public-data.world_bank_health_population\nbigquery-public-data.world_bank_global_population",
        "question": "How many countries experienced both a change in population and a change in Current health expenditure per capita, PPP (current international $) of greater than 1 in the year 2018?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq424",
        "db": "bigquery-public-data.world_bank_intl_debt\nbigquery-public-data.world_bank_wdi\nbigquery-public-data.world_bank_intl_education\nbigquery-public-data.world_bank_health_population\nbigquery-public-data.world_bank_global_population",
        "question": "List the top 10 countries with respect to the total amount of long-term external debt in descending order, excluding those without a specified region.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq327",
        "db": "bigquery-public-data.world_bank_intl_debt\nbigquery-public-data.world_bank_wdi\nbigquery-public-data.world_bank_intl_education\nbigquery-public-data.world_bank_health_population\nbigquery-public-data.world_bank_global_population",
        "question": "How many debt indicators for Russia have a value of 0, excluding NULL values?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq328",
        "db": "bigquery-public-data.world_bank_intl_debt\nbigquery-public-data.world_bank_wdi\nbigquery-public-data.world_bank_intl_education\nbigquery-public-data.world_bank_health_population\nbigquery-public-data.world_bank_global_population",
        "question": "Which region has the highest median GDP (constant 2015 US$) value?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq331",
        "db": "spider2-public-data.meta_kaggle",
        "question": "What are the usernames of the top 3 users whose message got most upvoted, and what is the difference between it and the average upvotes of all messages?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq380",
        "db": "spider2-public-data.meta_kaggle",
        "question": "What are the usernames of the top three users with the most upvotes received in the Kaggle forum, along with the number of upvotes they received and the number of upvotes they gave to others?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq370",
        "db": "spider2-public-data.wide_world_importers",
        "question": "How many customers have an equal number of orders and invoices, and where the total value of their orders matches the total value of their invoices?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq371",
        "db": "spider2-public-data.wide_world_importers",
        "question": "What is the difference between the maximum and minimum average invoice values across the quarters in the year 2013?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq372",
        "db": "spider2-public-data.wide_world_importers",
        "question": "Which customer category has the maximum order loss closest to the average maximum loss across all categories?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq373",
        "db": "spider2-public-data.wide_world_importers",
        "question": "What's the median of the average monthly spending across all customers for the year 2014?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq393",
        "db": "bigquery-public-data.hacker_news",
        "question": "Can you tell me the ID and corresponding month number of the user with the highest month number who became inactive after their last recorded activity month, considering data only up until September 10, 2024?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq403",
        "db": "bigquery-public-data.irs_990",
        "question": "Which three years in 2012-2017 have the smallest absolute difference between median revenue and median functional expenses for organizations filing IRS 990 forms? Please output respective differences as well.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq397",
        "db": "data-to-insights.ecommerce",
        "question": "Which country has the most total transactions in each channel, and what is the total number of transactions for that country where more than one country are involved?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq402",
        "db": "data-to-insights.ecommerce",
        "question": "What is the conversion rate from visitors to purchasers and the average number of transactions per purchaser using the web analytics data?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq160",
        "db": "spider2-public-data.meta_kaggle",
        "question": "Please tell me the creation date, title, parent forum, reply count, distinct user count, upvotes, and total views for the earliest five forum topics belonging to the parent forum named \"general\". Any value that is None should be regarded as 0.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq167",
        "db": "spider2-public-data.meta_kaggle",
        "question": "Please find the top giver-and-recipient pairs with the most Kaggle forum upvotes. Display their usernames and the respective number of upvotes they gave to each other.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq171",
        "db": "spider2-public-data.meta_kaggle",
        "question": "Whose upvotes are closest to the average in 2019? If there’s a tie, tell me the one with the alphabetically first username.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq118",
        "db": "spider2-public-data.death",
        "question": "How much higher is the average number of white people dying from discharges (excluding urethral discharge, firework discharge, and legal intervention involving firearm discharge) compared to vehicle-related incidents across different ages?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq072",
        "db": "spider2-public-data.death",
        "question": "Please tell me the total and Black deaths due to vehicle-related incidents and firearms separately, for each age from 12 to 18.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga001",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "I want to know the preferences of customers who purchased the Google Navy Speckled Tee in December 2020. What other product was purchased with the highest total quantity alongside this item?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga001_1",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Tell me the most purchased other products and their quantities by customers who bought the Google Red Speckled Tee each month for the three months starting from November 2020.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga003",
        "db": "firebase-public-project.analytics_153293282",
        "question": "I'm trying to evaluate which board types were most effective on September 15, 2018. Can you find out the average scores for each board type from the quick play mode completions on that day?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga004",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Can you figure out the average difference in pageviews between users who bought something and those who didn’t in December 2020? Just label anyone who was involved in purchase events as a purchaser.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga004_1",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Can you give me the average page views per buyer and total page views for each day in November 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga017",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "How many distinct users viewed the most frequently visited page during January 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga007",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Please find out what percentage of the page views on January 2, 2021, were for PDP type pages.",
        "external_knowledge": "ga4_page_category.md"
    },
    {
        "instance_id": "ga007_1",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "I want to know all the pages visited by user 1402138.5184246691 on January 2, 2021. Please show the names of these pages and adjust the names to PDP or PLP where necessary.",
        "external_knowledge": "ga4_page_category.md"
    },
    {
        "instance_id": "ga018",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Calculate the conversion rate from product list pages to product detail pages for all sessions at January 2nd, 2021.",
        "external_knowledge": "ga4_page_category.md"
    },
    {
        "instance_id": "ga031",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Calculate the user conversion rate for January 2nd, 2021, defined as the percentage of users who landed on the Home page and then proceeded to the Checkout Confirmation page during the same session.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga032",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Can you pull up the sequence of pages our customer 1362228 visited on January 28th 2021, linking them with '>>' between each page? I want to see their navigation flow through our site. Please merge adjacent identical pages into one, and refer to the docs to convert the corresponding pages to PDP, PLP if necessary.",
        "external_knowledge": "ga4_page_category.md"
    },
    {
        "instance_id": "ga006",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Provide the IDs and the average spending per session for users who were engaged in multiple purchase sessions in November 2020",
        "external_knowledge": null
    },
    {
        "instance_id": "ga009",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "I want to know the average number of engaged sessions per user of December 2020.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga010",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Can you give me an overview of our website traffic for December 2020? I'm particularly interested in the channel with the fourth highest number of sessions.",
        "external_knowledge": "ga4_dimensions_and_metrics.md"
    },
    {
        "instance_id": "ga010_1",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Please tell me the number of sessions for each website traffic channel in December 2020.",
        "external_knowledge": "ga4_dimensions_and_metrics.md"
    },
    {
        "instance_id": "ga011",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "What is the highest number of page views for any page path in December 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga012",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Find the transaction IDs, total item quantities, and purchase revenues for the item category with the highest tax rate on November 30, 2020.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga019",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Could you determine what percentage of users either did not uninstall our app within seven days or never uninstalled it after installing during August and September 2018?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga030",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Can you group users by the week they first used the app starting from July 2, 2018 and show which group has the most active users remained in the next four weeks, with each group named by the Monday date of that week? Please answer in the format of \" YYYY-MM-DD\".",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga030_1",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Can you group users by the week they first used the app, starting from July 9, 2018? I'd like to see the retention rate for each group over the next two weeks.",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga028",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Using the 7-day retention calculation method, find the number of users who first used the app in the week starting on \"2018-07-02\" and tell me the number of retained users for each week from 0 to 4 weeks.",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga020",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Which quickplay event type had the lowest user retention rate during the second week after their initial engagement, for users who first engaged between August 1 and August 15, 2018?",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga020_1",
        "db": "firebase-public-project.analytics_153293282",
        "question": "What is the retention rate for users two weeks after their initial quickplay event within the period from July 2, 2018, to July 16, 2018, calculated separately for each quickplay event type?",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga022",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Could you please help me get the weekly customer retention rate in September 2018 for new customers who first used our app within the first week starting from September 1st, 2018 (timezone in Shanghai)? The retention rates should cover the following 3-week period after the initial use and display them in column format.",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga025",
        "db": "firebase-public-project.analytics_153293282",
        "question": "For all users who first opened the app in September 2018 and then uninstalled within seven days, I want to know what percentage of them experienced an app crash.",
        "external_knowledge": null
    },
    {
        "instance_id": "local002",
        "db": "E_commerce",
        "question": "Can you calculate the 5-day symmetric moving average of predicted toy sales for December 5, 6, and 7, 2018, using daily sales data from January 1, 2017, to August 29, 2018, with a simple linear regression model? Provide the total of the moving averages for those three days.",
        "external_knowledge": null
    },
    {
        "instance_id": "local003",
        "db": "E_commerce",
        "question": "How much is the average sales per order per customer in each RFM bucket, considering only 'delivered' orders?",
        "external_knowledge": "RFM.md"
    },
    {
        "instance_id": "local004",
        "db": "E_commerce",
        "question": "Could you tell me the number of orders, average payment per order and customer lifespan in weeks of the 3 custumers with the highest average payment per order. Attention: I want the lifespan in float number if it's longer than one week, otherwise set it to be 1.0.",
        "external_knowledge": null
    },
    {
        "instance_id": "local007",
        "db": "Baseball",
        "question": "Could you help me calculate the average single career span value in years for all baseball players? Please precise the result as a float number.",
        "external_knowledge": null
    },
    {
        "instance_id": "local007_1",
        "db": "Baseball",
        "question": "I would like to know the names of baseball players who have achieved the highest value of games played, runs, hits, and home runs, with their corresponding score values.",
        "external_knowledge": null
    },
    {
        "instance_id": "local009",
        "db": "Airlines",
        "question": "What is the distance of the longest route where Abakan is either the departure or destination city (in kilometers)?",
        "external_knowledge": "haversine_formula.md"
    },
    {
        "instance_id": "local010",
        "db": "Airlines",
        "question": "Distribute all the unique city pairs into the distance ranges 0, 1000, 2000, 3000, 4000, 5000, and 6000+, based on their average distance of all routes between them. Then how many pairs are there in the distance range with the fewest unique city paires?",
        "external_knowledge": "haversine_formula.md"
    },
    {
        "instance_id": "local015",
        "db": "California_Traffic_Collision",
        "question": "Help me respectively caulculate the percentage of motorcycle accident fatalities involving riders who were wearing helmets and those who weren't?",
        "external_knowledge": null
    },
    {
        "instance_id": "local017",
        "db": "California_Traffic_Collision",
        "question": "In which year were the two most common causes of traffic accidents different from those in other years?",
        "external_knowledge": null
    },
    {
        "instance_id": "local017_1",
        "db": "California_Traffic_Collision",
        "question": "For the most common cause of traffic accidents in 2021, how much did its share (percentage in the annual roal incidents) decrease compared to 10 years earlier?",
        "external_knowledge": null
    },
    {
        "instance_id": "local019",
        "db": "WWE",
        "question": "For the NXT title that had the shortest match (excluding titles with \"title change\"), what were the names of the two wrestlers involved?",
        "external_knowledge": null
    },
    {
        "instance_id": "local026",
        "db": "IPL",
        "question": "Please help me find the top 3 bowlers who conceded the maximum runs in a single over, along with the corresponding matches.",
        "external_knowledge": null
    },
    {
        "instance_id": "local026_1",
        "db": "IPL",
        "question": "Which bowler has the lowest bowling average per wicket taken?",
        "external_knowledge": null
    },
    {
        "instance_id": "local026_2",
        "db": "IPL",
        "question": "Could you show me the average total score of strikers who have scored more than 50 runs in at least one match?",
        "external_knowledge": null
    },
    {
        "instance_id": "local026_3",
        "db": "IPL",
        "question": "Show me the names of strikers who scored no less than 100 runs in a match, but their team lost the game?",
        "external_knowledge": null
    },
    {
        "instance_id": "local026_4",
        "db": "IPL",
        "question": "Please help me find the names of top 5 players with the highest average runs per match in season 5, along with their batting averages.",
        "external_knowledge": null
    },
    {
        "instance_id": "local026_5",
        "db": "IPL",
        "question": "Can you help me find the top countries with the highest average runs per match for all players across all seasons, and also include their batting averages?",
        "external_knowledge": null
    },
    {
        "instance_id": "local026_6",
        "db": "IPL",
        "question": "Please calculate the average of the highest runs conceded in a single over for each match.",
        "external_knowledge": null
    },
    {
        "instance_id": "local028",
        "db": "Brazilian_E_Commerce",
        "question": "Could you generate a report that shows the number of delivered orders for each month in the years 2016, 2017, and 2018?",
        "external_knowledge": null
    },
    {
        "instance_id": "local028_1",
        "db": "Brazilian_E_Commerce",
        "question": "What is the highest monthly delivered orders volume in the year with the lowest annual delivered orders volume among 2016, 2017, and 2018?",
        "external_knowledge": null
    },
    {
        "instance_id": "local029",
        "db": "Brazilian_E_Commerce",
        "question": "Please calculate the average payment value, city, and state for the top 3 customers with the most delivered orders.",
        "external_knowledge": null
    },
    {
        "instance_id": "local030",
        "db": "Brazilian_E_Commerce",
        "question": "Can you find the average payments and order counts for the five cities with the lowest total payments from delivered orders?",
        "external_knowledge": null
    },
    {
        "instance_id": "local032",
        "db": "Brazilian_E_Commerce",
        "question": "Could you help me find the sellers respectively with the highest number of distinct customers, highest profit, highest number of distinct orders, and most 5-star ratings, in delivered orders, along with their corresponding values? ",
        "external_knowledge": null
    },
    {
        "instance_id": "local034",
        "db": "Brazilian_E_Commerce",
        "question": "Could you help me calculate the average of the total payment count for the most preferred payment method in each product category?",
        "external_knowledge": null
    },
    {
        "instance_id": "local034_1",
        "db": "Brazilian_E_Commerce",
        "question": "What are the top three product categories with the highest number of payments, and how many payments were made in each category?",
        "external_knowledge": null
    },
    {
        "instance_id": "local035",
        "db": "Brazilian_E_Commerce",
        "question": "Please help me find two adjacent cities with the greatest distance between them.",
        "external_knowledge": "spherical_law.md"
    },
    {
        "instance_id": "local038",
        "db": "Pagila",
        "question": "Could you help me find the actor who appeared most in English G or PG-rated children's movies no longer than 2 hours, released between 2000 and 2010？Give me a full name.",
        "external_knowledge": null
    },
    {
        "instance_id": "local039",
        "db": "Pagila",
        "question": "Please help me find the film category with the highest total rental hours in cities where the city's name either starts with \"A\" or contains a hyphen. ",
        "external_knowledge": null
    },
    {
        "instance_id": "local040",
        "db": "modern_data",
        "question": "Which three boroughs have the highest number of trees, and what is the average mean income for each, considering only areas where both median and mean income estimates are greater than zero, and using the available ZIP code income data when tree ZIP codes are missing?",
        "external_knowledge": null
    },
    {
        "instance_id": "local041",
        "db": "modern_data",
        "question": "What percentage of trees in the Bronx have a health status of Good?",
        "external_knowledge": null
    },
    {
        "instance_id": "local053_1",
        "db": "modern_data",
        "question": "Can you help me calculate the average number of new unicorn companies per year in the top industry from 2019 to 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "local054",
        "db": "chinook",
        "question": "Could you tell me the first names of customers who spent less than $1 on albums by the best-selling artist, along with the amounts they spent?",
        "external_knowledge": null
    },
    {
        "instance_id": "local054_2",
        "db": "chinook",
        "question": "What is the difference in average spending between customers who bought albums from the best-selling artist and those who bought from the least-selling artist? If there is a tie for either best-selling or lowest-selling, choose the artist whose name comes first alphabetically.",
        "external_knowledge": null
    },
    {
        "instance_id": "local056",
        "db": "sqlite-sakila",
        "question": "Which customer has the highest average monthly change in payment amounts? Provide the customer's full name.",
        "external_knowledge": null
    },
    {
        "instance_id": "local058",
        "db": "education_business",
        "question": "Can you provide a list of hardware product segments along with their unique product counts for 2020, ordered by the highest percentage increase in unique fact sales products from 2020 to 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "local059",
        "db": "education_business",
        "question": "What is the average quantity sold for the top 3 hardware products in each division in 2021? I want the answer in descending order of the average quantity.",
        "external_knowledge": null
    },
    {
        "instance_id": "local060",
        "db": "complex_oracle",
        "question": "What is the change in sales share and name of each product in the top 20% of products (by sales) between Q4 of 2019 and 2020 in the US, excluding those with any promotion? Please provide the results in decreasing order of the change in sales share.",
        "external_knowledge": null
    },
    {
        "instance_id": "local060_3",
        "db": "complex_oracle",
        "question": "Which product has the smallest change in sales share for each product from the top 20% of products between Q4 in 2019 and 2020 in US without any promotion?",
        "external_knowledge": null
    },
    {
        "instance_id": "local061",
        "db": "complex_oracle",
        "question": "What is the average monthly projected sales in USD for France in 2021? Please use data from 2019 and 2020 for projection.",
        "external_knowledge": "projection_calculation.md"
    },
    {
        "instance_id": "local061_2",
        "db": "complex_oracle",
        "question": "What is the median value from average monthly projected sales in USD for France in 2021? Please use data from 2019 and 2020 for projection.",
        "external_knowledge": "projection_calculation.md"
    },
    {
        "instance_id": "local062",
        "db": "complex_oracle",
        "question": "Can you divide customers in Italy into 10 buckets based on their monthly profitability and calculate the following for each bucket in December 2021: the number of customers, maximum profit, and minimum profit? Please provide the results in increasing order of buckets.",
        "external_knowledge": null
    },
    {
        "instance_id": "local062_1",
        "db": "complex_oracle",
        "question": "Could you group customers in Italy into 10 buckets based on their monthly profitability in December 2021 and then find the top 3 highest maximum profit buckets and their corresponding maximum profit?",
        "external_knowledge": null
    },
    {
        "instance_id": "local062_2",
        "db": "complex_oracle",
        "question": "Could you group customers in Italy into 10 buckets based on their monthly profitability in December 2021 and calculate the average from minimum profits of each bucket?",
        "external_knowledge": null
    },
    {
        "instance_id": "local062_3",
        "db": "complex_oracle",
        "question": "Could you group customers in Italy into 10 buckets based on their monthly profitability in December 2021 and calculate the average from maximum profits of each bucket?",
        "external_knowledge": null
    },
    {
        "instance_id": "local062_4",
        "db": "complex_oracle",
        "question": "Could you group customers in Italy into 10 buckets based on their monthly profitability in December 2021 and calculate the difference between the largest and smallest number of customer?",
        "external_knowledge": null
    },
    {
        "instance_id": "local070_3",
        "db": "city_legislation",
        "question": "For cities, could you review our records for Canada in April 2022 and identify the longest streak of consecutive inserted dates? Please list all the dates along with the corresponding city names during this streak.",
        "external_knowledge": null
    },
    {
        "instance_id": "local070_3_2",
        "db": "city_legislation",
        "question": "Review our records for China in June 2021 and identify the shortest streak of consecutive inserted dates. List all the dates along with the corresponding city names during this streak.",
        "external_knowledge": null
    },
    {
        "instance_id": "local070_3_3",
        "db": "city_legislation",
        "question": "Could you review our records in June 2022 and identify which countries have the longest streak of consecutive inserted city dates? Please list the 2-letter length country codes of these countries.",
        "external_knowledge": null
    },
    {
        "instance_id": "local070_3_4",
        "db": "city_legislation",
        "question": "How many countries have more than 10 consecutive city insertion dates in June 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "local070_3_5",
        "db": "city_legislation",
        "question": "Find the proportion of capital cities in the longest consecutive insertion period in the Iran during January 2022.",
        "external_knowledge": null
    },
    {
        "instance_id": "local070_4_2",
        "db": "city_legislation",
        "question": "Calculate the number of new cities inserted each June and the year-over-year growth percentage for June. List the year, the total number of cities added each month, the running total, and the year-over-year growth percentage for running total.",
        "external_knowledge": null
    },
    {
        "instance_id": "local070_4_3",
        "db": "city_legislation",
        "question": "calculate the number of new cities inserted each April and the year-over-year growth percentage for each April.",
        "external_knowledge": null
    },
    {
        "instance_id": "local073_4",
        "db": "modern_data",
        "question": "Let's generate a report for each pizza order that lists all the ingredients in alphabetical order. If any ingredient is ordered more than once, indicate it with '2x'. This will help us optimize our inventory management.",
        "external_knowledge": null
    },
    {
        "instance_id": "local073_5",
        "db": "modern_data",
        "question": "Based on our customer pizza order information, summarize the total quantity of each ingredient used in the pizzas we delivered. Output the name and quantity for each ingredient.",
        "external_knowledge": null
    },
    {
        "instance_id": "local073_6",
        "db": "modern_data",
        "question": "Calculate the total income from Meat Lovers pizzas priced at $12 and Vegetarian pizzas at $10. Include any extra toppings charged at $1 each. How much money has Pizza Runner earned in total?",
        "external_knowledge": null
    },
    {
        "instance_id": "local074",
        "db": "bank_sales_trading",
        "question": "Please generate a summary of the closing balances at the end of each month for each customer transactions, show the monthly changes and monthly cumulative bank account balances.",
        "external_knowledge": null
    },
    {
        "instance_id": "local074_4",
        "db": "bank_sales_trading",
        "question": "What is the difference in average month-end balance between the month with the most and the month with the fewest customers having a positive balance in 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "local297",
        "db": "bank_sales_trading",
        "question": "I want to know if the closing balances of each customer have increased by at least 5% in the most recent month based on their existing data. Can you provide these figures? (If the previous month's balance is zero, multiply the current balance by 100 as the growth rate)",
        "external_knowledge": null
    },
    {
        "instance_id": "local298",
        "db": "bank_sales_trading",
        "question": "We need to optimize our data allocation strategy. One option we're considering is allocating data based on the customer’s balance at the end of the previous month. Could you calculate the monthly data requirements for this approach, starting from February",
        "external_knowledge": null
    },
    {
        "instance_id": "local299",
        "db": "bank_sales_trading",
        "question": "To optimize our data allocation strategy, calculate the average balance for each customer over the past 30 days on a monthly basis. Identify the highest average balance among all customers each month and sum these highest values to determine the total data allocation needed, starting from February.",
        "external_knowledge": null
    },
    {
        "instance_id": "local300",
        "db": "bank_sales_trading",
        "question": "We need to understand the trends in customer account balances. Calculate the sum of the highest daily balances for each customer per month. This data will help us forecast future resource needs.",
        "external_knowledge": null
    },
    {
        "instance_id": "local075_2",
        "db": "bank_sales_trading",
        "question": " Can you provide a breakdown of how many times each product was viewed, how many times they were added to the shopping cart, and how many times they were left in the cart without being purchased? Also, give me the count of actual purchases for each product.",
        "external_knowledge": null
    },
    {
        "instance_id": "local077",
        "db": "bank_sales_trading",
        "question": "Please review our interest data from September 2018 to August 2019. I need to know the max average composition value for each month, as well as the three-month rolling average. Ensure the output includes the date, the interest name, the max index composition for that month, the rolling average, and the top-ranking interests from the one month ago and two months ago with their names.",
        "external_knowledge": null
    },
    {
        "instance_id": "local077_2",
        "db": "bank_sales_trading",
        "question": "Identify the top 10 and bottom 10 interest categories based on their highest composition values across all months. For each category, display the time(MM-YYYY), interest name, and the composition value",
        "external_knowledge": null
    },
    {
        "instance_id": "local081",
        "db": "northwind",
        "question": "How many customers were in each spending group in 1998, and what percentage of the total customer base does each group represent?",
        "external_knowledge": null
    },
    {
        "instance_id": "local084",
        "db": "northwind",
        "question": "Can you tell me the ID of employee who has the highest proportion of late orders compared to their total orders?",
        "external_knowledge": null
    },
    {
        "instance_id": "local085",
        "db": "northwind",
        "question": "Can you tell me the ID of the top 3 employees who have the highest percentage of orders delivered late, considering only those with more than 50 total orders? Also provide their respective number of late orders and the percentage. ",
        "external_knowledge": null
    },
    {
        "instance_id": "local096",
        "db": "Db-IMDB",
        "question": "I'm interested in knowing the proportion of films that had exclusively female actors for each year. Can you also include the total film count for each of those years?",
        "external_knowledge": null
    },
    {
        "instance_id": "local097",
        "db": "Db-IMDB",
        "question": "I'm curious about the most prolific decade in terms of film production. Could you analyze our data and identify which decade had the largest number of films? I need the total count for that specific period.",
        "external_knowledge": null
    },
    {
        "instance_id": "local098",
        "db": "Db-IMDB",
        "question": "I'd like to know how many actors have managed to avoid long breaks in their careers. Could you check our records to see how many actors haven't been out of work for more than three years at any point?",
        "external_knowledge": null
    },
    {
        "instance_id": "local099",
        "db": "Db-IMDB",
        "question": "I need you to look into the actor collaborations and tell me how many actors have made more films with Yash Chopra than with any other director. This will help us understand his influence on the industry better.",
        "external_knowledge": null
    },
    {
        "instance_id": "local100",
        "db": "Db-IMDB",
        "question": "Can you investigate our database and find out how many actors have a 'Shahrukh number' of 2? This means they acted in a film with someone who acted with Shahrukh Khan, but not directly with him.",
        "external_knowledge": null
    },
    {
        "instance_id": "local114",
        "db": "education_business",
        "question": "How many total orders were placed for the region with the largest web sales in USD?",
        "external_knowledge": null
    },
    {
        "instance_id": "local128",
        "db": "BowlingLeague",
        "question": "Can you list the bowlers, the match number, the game number, the handicap score, the tournament date, and the tournament location for bowlers who won a game with a handicap score of 190 or less at Thunderbird Lanes, Totem Lanes, and Bolero Lanes?",
        "external_knowledge": null
    },
    {
        "instance_id": "local130",
        "db": "school_scheduling",
        "question": "Can you list the last name of all students who have completed English courses, rank them by Quintile based on the grades they received, and order the results from the highest to the lowest grades?",
        "external_knowledge": null
    },
    {
        "instance_id": "local131",
        "db": "EntertainmentAgency",
        "question": "Which musical styles are the most frequently ranked as first, second, or third preferences, and how many times does each style appear in each rank?",
        "external_knowledge": null
    },
    {
        "instance_id": "local131_3",
        "db": "EntertainmentAgency",
        "question": "Which musical style has a weighted score closest to the average, where first preferences are weighted by 3, second preferences by 2, and third preferences by 1, if there are ties, choose the one that comes first alphabetically?",
        "external_knowledge": null
    },
    {
        "instance_id": "local132",
        "db": "EntertainmentAgency",
        "question": "Show entertainer and customer pairs where both the first and second style preferences of customers match the first and second strengths of entertainers (or vice versa), displaying only the entertainer's stage name and the customer's last name.",
        "external_knowledge": null
    },
    {
        "instance_id": "local141",
        "db": "AdventureWorks",
        "question": "How did each salesperson's annual total sales compare to their annual sales quota? Provide the difference between their total sales and the quota for each year, organized by salesperson and year.",
        "external_knowledge": null
    },
    {
        "instance_id": "local152",
        "db": "imdb_movies",
        "question": "Can you provide the top 9 directors by movie count, including their ID, name, number of movies, average inter-movie duration (rounded to the nearest integer), average rating (rounded to 2 decimals), total votes, minimum and maximum ratings, and total movie duration?",
        "external_knowledge": null
    },
    {
        "instance_id": "local230",
        "db": "imdb_movies",
        "question": "Please analyze our database to identify the top three genres with the most movies that have ratings above 8. Then, determine which director has directed the most movies in these genres and provide the number of movies for each director.",
        "external_knowledge": null
    },
    {
        "instance_id": "local156",
        "db": "bank_sales_trading",
        "question": "Could you provide the yearly average cost of Bitcoin purchases for each region? Rank the regions based on these averages for each year, and calculate the annual percentage change. This data will be crucial for our upcoming financial planning. Please exclude the results for 2017 from the output.",
        "external_knowledge": null
    },
    {
        "instance_id": "local157",
        "db": "bank_sales_trading",
        "question": "For our upcoming meeting, please provide the daily percentage change in trading volume for all tickers from August 1 to August 10, 2021. Use the Bitcoin transaction data to calculate.",
        "external_knowledge": null
    },
    {
        "instance_id": "local162_2",
        "db": "education_business",
        "question": "Which university faculty members' salaries are closest to the average salary for their respective ranks? Please provide the ranks, first names, last names, and salaries.university",
        "external_knowledge": null
    },
    {
        "instance_id": "local168",
        "db": "city_legislation",
        "question": "What is the average salary for remote Data Analyst jobs requiring the top three most in-demand skills?",
        "external_knowledge": null
    },
    {
        "instance_id": "local169",
        "db": "city_legislation",
        "question": "What is the annual retention rate for Colorado legislators who started their first term between 1917 and 1999, tracked up to 20 years later?",
        "external_knowledge": null
    },
    {
        "instance_id": "local169_1",
        "db": "city_legislation",
        "question": "What is the number of male legislators from Louisiana who have served more than 30 years since their first term, grouped by their years of service, for periods less than 50 years?",
        "external_knowledge": null
    },
    {
        "instance_id": "local169_2",
        "db": "city_legislation",
        "question": "Which state has the highest number of female legislators whose term end dates fall on December 31st, and what is that count? Please provide state name abbreviation.",
        "external_knowledge": null
    },
    {
        "instance_id": "local170",
        "db": "city_legislation",
        "question": "Which states have a consistently non-zero retention rate for legislators across every two-year interval (0, 2, 4, 6, 8, 10) in the first 10 years after they begin serving? Please provide state name abbreviation.",
        "external_knowledge": null
    },
    {
        "instance_id": "local193",
        "db": "sqlite-sakila",
        "question": "Could you find out the average percentage of the total lifetime sales (LTV) that occur in the first 7 and 14 days after a customer's initial purchase? Also, include the average total lifetime sales (LTV). Please exclude customers with zero lifetime sales. The percentage should be shown with %.",
        "external_knowledge": null
    },
    {
        "instance_id": "local194",
        "db": "sqlite-sakila",
        "question": "I'd like a report on our top-performing films based on revenue per actor. Could you provide a list of the top-three films that generate the most revenue for each actor involved and the average revenue?",
        "external_knowledge": null
    },
    {
        "instance_id": "local195",
        "db": "sqlite-sakila",
        "question": "Please find out how widespread the appeal of our top five actors is. What percentage of our customers have rented films featuring these actors?",
        "external_knowledge": null
    },
    {
        "instance_id": "local196",
        "db": "sqlite-sakila",
        "question": "For the ratings of the first movie rented by customers, please provide the average total spend and the average number of subsequent rentals for each rating category.",
        "external_knowledge": null
    },
    {
        "instance_id": "local196_2",
        "db": "sqlite-sakila",
        "question": "Can you determine which of our top 10 paying customers had the highest payment difference in any given month? I'd like to know the highest payment difference for this customer.",
        "external_knowledge": null
    },
    {
        "instance_id": "local196_3",
        "db": "sqlite-sakila",
        "question": "Can you identify the year and month with the highest rental orders for each store? Please list the store ID, the year, the month, and the total rentals for those dates.",
        "external_knowledge": null
    },
    {
        "instance_id": "local198",
        "db": "chinook",
        "question": "What is the median total sales from countries with more than 4 customers?",
        "external_knowledge": null
    },
    {
        "instance_id": "local201",
        "db": "modern_data",
        "question": "Which are the first 10 words (of length 4 to 5, starting with 'r') sorted alphabetically, and what is the count of their anagrams?",
        "external_knowledge": null
    },
    {
        "instance_id": "local202",
        "db": "city_legislation",
        "question": "For alien data, how many of the top 10 states by alien population have a higher percentage of friendly aliens than hostile aliens, with an average alien age exceeding 200?",
        "external_knowledge": null
    },
    {
        "instance_id": "local209",
        "db": "delivery_center",
        "question": "Can you calculate the delivery completion ratio of the store with the most orders?",
        "external_knowledge": null
    },
    {
        "instance_id": "local210",
        "db": "delivery_center",
        "question": "Can you identify the hubs that saw more than a 20% increase in finished orders from February to March?",
        "external_knowledge": null
    },
    {
        "instance_id": "local211_2",
        "db": "delivery_center",
        "question": "Can you find 5 delivery drivers with the highest average number of daily deliveries?",
        "external_knowledge": null
    },
    {
        "instance_id": "local218",
        "db": "EU_soccer",
        "question": "Can you calculate the median from the highest season goals of each team?",
        "external_knowledge": null
    },
    {
        "instance_id": "local219",
        "db": "EU_soccer",
        "question": "Which team has the fewest wins in each league?",
        "external_knowledge": null
    },
    {
        "instance_id": "local219_2",
        "db": "EU_soccer",
        "question": "Tell me top10 teams with the most wins across the league",
        "external_knowledge": null
    },
    {
        "instance_id": "local220",
        "db": "EU_soccer",
        "question": "Who is the player with the most wins?",
        "external_knowledge": null
    },
    {
        "instance_id": "local220_1",
        "db": "EU_soccer",
        "question": "Who is the player with the most losses?",
        "external_knowledge": null
    },
    {
        "instance_id": "local228",
        "db": "IPL",
        "question": "Identify the top three batsmen with the most runs and the top three bowlers with the most wickets in each season. In case of ties, prioritize players with lower player_ids. Exclude 'run out', 'hit wicket', and 'retired hurt' as out_types for bowlers.",
        "external_knowledge": null
    },
    {
        "instance_id": "local229",
        "db": "IPL",
        "question": "Find the IDs of players who scored the highest number of partnership runs for each match. The output should include the IDs of two players, each with their individual scores and the total partnership score. There can  be multiple rows for a single match.",
        "external_knowledge": null
    },
    {
        "instance_id": "local244",
        "db": "music",
        "question": "Calculate the duration of each track, classify them as short (duration between the minimum value and the midpoint between the minimum and average values), medium (duration between the midpoint between the minimum and average values and the midpoint between the average and maximum values), or long (duration between the midpoint between the average and maximum values and the maximum value), output the minimum and maximum time for each kind (in minutes) and the total revenue for each category, group by the category.",
        "external_knowledge": null
    },
    {
        "instance_id": "local253",
        "db": "education_business",
        "question": "For the salary dataset, create a detailed SQL report that compares the top 5 companies by average salary in Mumbai, Pune, New Delhi, and Hyderabad to the national average salary. The report should include the following columns: Location, Company Name, Average Salary in State, and Average Salary in Country.",
        "external_knowledge": null
    },
    {
        "instance_id": "local258",
        "db": "IPL",
        "question": "We want to obtain statistical information for each player, including their ID, name, role, batting hand, bowling skill, total runs, total matches, number of dismissals, batting average, highest score, number of times scoring over 30, 50, and 100, total balls faced, strike rate, total wickets taken, economy rate, and the bowling data (in a 'wickets-runs given' format) for the match where they took the most wickets.",
        "external_knowledge": null
    },
    {
        "instance_id": "local259",
        "db": "IPL",
        "question": "",
        "external_knowledge": null
    },
    {
        "instance_id": "local262",
        "db": "stacking",
        "question": "Identify the models where, across all steps and versions, traditional models (excluding the Stack model) perform worse than the Stack model more times than the total number of evaluations of that model across all steps.",
        "external_knowledge": null
    },
    {
        "instance_id": "local263",
        "db": "stacking",
        "question": "Which L1_model has the highest occurrence for each status ('strong' where the maximum test score for non-'Stack' models is less than the 'Stack' score, and 'soft' where they are equal), and how many times does it occur?",
        "external_knowledge": null
    },
    {
        "instance_id": "local263_1",
        "db": "stacking",
        "question": "Which model category (L1_model) appears the most frequently across all steps and versions when comparing traditional models to the Stack model, and what is the total count of its occurrences?",
        "external_knowledge": null
    },
    {
        "instance_id": "local269",
        "db": "oracle_sql",
        "question": "What is average quantity across all packaging combinations?",
        "external_knowledge": null
    },
    {
        "instance_id": "local270",
        "db": "oracle_sql",
        "question": "Which packaging containers include items in quantities greater than 500, and what are those items?",
        "external_knowledge": null
    },
    {
        "instance_id": "local272",
        "db": "oracle_sql",
        "question": "Which product ID, aisle, and position should be selected to pick the highest quantity for order 423, ensuring the picked quantity does not exceed the available inventory in warehouse 1, and calculate the quantity to be picked while prioritizing locations with earlier dates and smaller quantities?",
        "external_knowledge": null
    },
    {
        "instance_id": "local273",
        "db": "oracle_sql",
        "question": "What is the average pick percentage for each product, considering the quantity picked from inventory locations that are ordered by the earliest purchase date and smallest quantity, while ensuring that the picked quantity matches the overlapping range between the order quantity and the available inventory?",
        "external_knowledge": null
    },
    {
        "instance_id": "local274",
        "db": "oracle_sql",
        "question": "Which products were picked for order 421, and what is the average number of units picked for each product, using FIFO (First-In, First-Out) method?",
        "external_knowledge": null
    },
    {
        "instance_id": "local275",
        "db": "oracle_sql",
        "question": "What are products with a seasonality-adjusted sales ratio greater than 2 for the year 2017, based on monthly sales data starting from January 2016?",
        "external_knowledge": "calculation_method.md"
    },
    {
        "instance_id": "local277",
        "db": "oracle_sql",
        "question": "What is the average forecasted annual sales for products 4160 and 7790 in 2018, using a weighted regression model based on the first 36 months from January 2016, with time steps between 7 and 30?",
        "external_knowledge": "calculation_method.md"
    },
    {
        "instance_id": "local279",
        "db": "oracle_sql",
        "question": "Can you provide the product_id, month, and the smallest difference between the inventory and the minimum required level for each product in 2019?",
        "external_knowledge": null
    },
    {
        "instance_id": "local283",
        "db": "EU_soccer",
        "question": "Analyze our match data to identify the name, leagues, and countries of the champion team for each season. Include the total points accumulated by each team.",
        "external_knowledge": null
    },
    {
        "instance_id": "local284",
        "db": "bank_sales_trading",
        "question": "For veg whsle data, can you generate a summary of our items' loss rates? Include the average loss rate, and also break down the count of items that are below, above, and within one standard deviation from this average.",
        "external_knowledge": null
    },
    {
        "instance_id": "local285",
        "db": "bank_sales_trading",
        "question": "For veg whsle data, can you analyze our financial performance over the years 2020 to 2023? I need insights into the average wholesale price, maximum wholesale price, minimum wholesale price, wholesale price difference, total wholesale price, total selling price, average loss rate, total loss, and profit for each category within each year.",
        "external_knowledge": null
    },
    {
        "instance_id": "local286",
        "db": "electronic_sales",
        "question": "Prepare a comprehensive performance report on our sellers, focusing on total sales, average item price, average review scores, and packing times. Ensure that the report includes only those sellers who handle more than 100 products and highlight their top-selling product.",
        "external_knowledge": null
    },
    {
        "instance_id": "local301",
        "db": "bank_sales_trading",
        "question": "For weekly-sales data, I need an analysis of our sales performance around mid-June for the years 2018, 2019, and 2020. Specifically, calculate the percentage change in sales between the four weeks leading up to June 15 and the four weeks following June 15 for each year.",
        "external_knowledge": null
    },
    {
        "instance_id": "local302",
        "db": "bank_sales_trading",
        "question": "For weekly-sales data, analyze the sales performance across various business areas for the 12 weeks before and after June 15, 2020. Focus on regions, platforms, age band, demographics, and customer types, identify the area with the highest negative impact in sales metrics performance, provied its name and the percentage change in sales.",
        "external_knowledge": null
    },
    {
        "instance_id": "local329",
        "db": "log",
        "question": "How many unique sessions visited the /regist/input page and then the /regist/confirm page, in that order?",
        "external_knowledge": null
    },
    {
        "instance_id": "local329_2",
        "db": "log",
        "question": "Which path has the highest total count of visits across both landing and exit types? ",
        "external_knowledge": null
    },
    {
        "instance_id": "local331",
        "db": "log",
        "question": "What are the top three most frequent third steps and their respective occurrences that users take after visiting the /detail page twice in a row?",
        "external_knowledge": null
    },
    {
        "instance_id": "local332",
        "db": "log",
        "question": "What are the top three sessions and their duration (in seconds) based on total time spent?",
        "external_knowledge": null
    },
    {
        "instance_id": "local334",
        "db": "log",
        "question": "What is the action count for the most frequent user action, categorized by login status?",
        "external_knowledge": null
    },
    {
        "instance_id": "local334_1",
        "db": "log",
        "question": "What is the difference between the maximum and minimum action counts for user actions, categorized by login status?",
        "external_knowledge": null
    },
    {
        "instance_id": "local344",
        "db": "f1",
        "question": "How many times has each type of overtake occurred in Formula 1?",
        "external_knowledge": "f1_overtake.md"
    },
    {
        "instance_id": "local344_1",
        "db": "f1",
        "question": "How many overtakes of each type occurred during the first five laps of the race?",
        "external_knowledge": "f1_overtake.md"
    },
    {
        "instance_id": "local335",
        "db": "f1",
        "question": "Which five constructors have had the most seasons in the 21st century where their drivers scored the fewest points in a Formula 1 season?",
        "external_knowledge": null
    },
    {
        "instance_id": "local309",
        "db": "f1",
        "question": "For each year, which driver and which constructor scored the most points? I want the full name of each driver.",
        "external_knowledge": null
    },
    {
        "instance_id": "local309_2",
        "db": "f1",
        "question": "Which three years had the lowest combined points between the top driver and the top constructor in the same year?",
        "external_knowledge": null
    },
    {
        "instance_id": "local309_3",
        "db": "f1",
        "question": "Which constructors had the top 3 combined points from their best driver and team, and in which years did they achieve them?",
        "external_knowledge": null
    },
    {
        "instance_id": "local353",
        "db": "f1",
        "question": "What are the five most frequent types of laps, and their respective frequencies in race 1?",
        "external_knowledge": "lap_type.md"
    },
    {
        "instance_id": "local354",
        "db": "f1",
        "question": "Can you tell me the driver IDs of those who participated in multiple races during a season in the 1950s where none of their races were the first or last of the season?",
        "external_knowledge": null
    },
    {
        "instance_id": "local355",
        "db": "f1",
        "question": "What is the average round number of the first and last missed rounds for drivers who missed fewer than 3 rounds and had different constructors immediately before and after their missed rounds?",
        "external_knowledge": null
    },
    {
        "instance_id": "local356",
        "db": "f1",
        "question": "Can you tell me the full names of drivers who have been overtaken more times than they have performed overtakes?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf001",
        "db": "GLOBAL_WEATHER__CLIMATE_DATA_FOR_BI.STANDARD_TILE",
        "question": "Assuming today is April 1, 2024, I would like to know the daily snowfall amounts greater than 6 inches for each U.S. postal code during the week ending after the first two full weeks of the previous year. Show the postal code, date, and snowfall amount.",
        "external_knowledge": null
    },
    {
        "instance_id": "sf003",
        "db": "GLOBAL_GOVERNMENT.CYBERSYN",
        "question": "From 2015 to 2020, which zip code in Census Zip Code Tabulation Areas had the second-highest annual population growth rate, given a minimum estimate of 25,000 people over a 5-year period? Include the zip code, state abbreviation, and growth rate.",
        "external_knowledge": null
    },
    {
        "instance_id": "sf002",
        "db": "FINANCE__ECONOMICS.CYBERSYN",
        "question": "As of December 31, 2022, which top 10 active large banks, each with assets over $10 billion, had the highest percentage of uninsured assets based on quarterly estimates? ",
        "external_knowledge": null
    },
    {
        "instance_id": "sf044",
        "db": "FINANCE__ECONOMICS.CYBERSYN",
        "question": "What is the percentage change in post-market close prices for the Magnificent 7 tech companies from January 1 to June 30, 2024?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf006",
        "db": "FINANCE__ECONOMICS.CYBERSYN",
        "question": "What is the change ratio in the number of active financial branch entities in each state from before March 1, 2020, to the end of 2021? ",
        "external_knowledge": null
    },
    {
        "instance_id": "sf008",
        "db": "US_REAL_ESTATE.CYBERSYN",
        "question": "What is the percentage change in gross income inflow and purchase-only seasonally-adjusted home price index for the Phoenix-Mesa-Scottsdale, AZ Metro Area from the beginning to the end of 2023?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf010",
        "db": "US_REAL_ESTATE.CYBERSYN",
        "question": "What are the cumulative percentages of mortgages near default in California for each recorded date in 2023, including those 90 to 180 days past due, in forbearance, or in the process of foreclosure, bankruptcy, or deed in lieu?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf037",
        "db": "US_REAL_ESTATE.CYBERSYN",
        "question": "For each Home Depot store identified by its POI ID, what is the distance in miles to the nearest Lowe's Home Improvement store?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf012",
        "db": "WEATHER__ENVIRONMENT.CYBERSYN",
        "question": "What were the total amounts of building and contents damage reported under the National Flood Insurance Program in the City of New York for each year from 2010 to 2019?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf018",
        "db": "BRAZE_USER_EVENT_DEMO_DATASET.PUBLIC",
        "question": "Examine user engagement with push notifications within a specified one-hour window on June 1, 2023.",
        "external_knowledge": "PushNotificationAnalysis.md"
    },
    {
        "instance_id": "sf035",
        "db": "BRAZE_USER_EVENT_DEMO_DATASET.PUBLIC",
        "question": "How many unique users started sessions each day within each app group between June 1, 2023, and June 7, 2023? Also show the app group ID and the start day of the session.",
        "external_knowledge": null
    },
    {
        "instance_id": "sf029",
        "db": "AMAZON_VENDOR_ANALYTICS__SAMPLE_DATASET.PUBLIC",
        "question": "Generate a daily detailed report for each product, showing sales units, revenue, average selling price (ASP), glance views, conversion rate, shipped units, shipped revenue, average net profit margin (PPM), and inventory details, starting 30 days prior to February 6, 2022, and including that date, for products under the 'Manufacturing' distributor view?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf040",
        "db": "US_ADDRESSES__POI.CYBERSYN",
        "question": "Find the top 10 northernmost addresses in Florida's largest zip code area. What are their address numbers, street names, and types?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf009",
        "db": "NETHERLANDS_OPEN_MAP_DATA.NETHERLANDS",
        "question": "A real estate company is looking for a comparison of the building types in Amsterdam and Rotterdam. They need to know the total surface area and the number of buildings for each type of building in both cities. Can you provide the building class and subclass, along with the total surface area and the number of buildings for both Amsterdam and Rotterdam?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf013",
        "db": "NETHERLANDS_OPEN_MAP_DATA.NETHERLANDS",
        "question": "Determine the total length of roads for each class and subclass in Amsterdam and Rotterdam, based on specific QUADKEY segments '12020210' and '12020211'? Show the class, subclass, and total road lengths for both cities",
        "external_knowledge": null
    },
    {
        "instance_id": "sf041",
        "db": "YES_ENERGY__SAMPLE_DATA.YES_ENERGY_SAMPLE",
        "question": "Generate a detailed analysis report for ERCOT on October 1, 2022, that integrates pricing, load forecasts, real-time load, and renewable generation data to provide insights into daily market dynamics and operational efficiency?",
        "external_knowledge": null
    },
    {
        "instance_id": "sf011",
        "db": "CENSUS_GALAXY__ZIP_CODE_TO_BLOCK_GROUP_SAMPLE.PUBLIC",
        "question": "Determine the population distribution within each block group relative to its census tract in New York State using 2021 ACS data. Include block group ID, census value, state county tract ID, total tract population, and the population ratio of each block group.",
        "external_knowledge": null
    },
    {
        "instance_id": "sf014",
        "db": "CENSUS_GALAXY__AIML_MODEL_DATA_ENRICHMENT_SAMPLE.PUBLIC",
        "question": "What is the New York State ZIP code with the highest number of commuters traveling over one hour, according to 2021 ACS data? Include the total commuters, state benchmark for this duration, and state population.",
        "external_knowledge": null
    }
]