[
    {
        "instance_id": "bq011",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "How many pseudo users were active in the last 7 days but inactive in the last 2 days as of January 7, 2021?",
        "external_knowledge": "ga4_obfuscated_sample_ecommerce.events.md"
    },
    {
        "instance_id": "bq010",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Find the top-selling product among customers who bought 'Youtube Men’s Vintage Henley' in July 2017, excluding itself.",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq009",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Which traffic source receives the top revenue in 2017 and what is the difference (millions, rounded to two decimal places) between its highest and lowest revenue months?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq001",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "I wonder how many days between the first transaction and the first visit for each transacting visitor in Feburary 2017, along with the device used in the transaction.",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq002",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What's the maximum monthly, weekly, and daily product revenues (in millions) generated by the top-performing traffic source in the first half of 2017?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq003",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Compare the average pageviews per visitor between purchase and non-purchase sessions for each month from April to July in 2017.",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq004",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What's the most popular other purchased product in July 2017 with consumers who bought products relevant to YouTube?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq008",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What's the most common next page for visitors who were part of \"Data Share\" campaign and after they accessed the page starting with '/home' in January 2017. And what's the maximum duration time (in seconds) when they visit the corresponding home page?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq269",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Compute the average pageviews per visitor for non-purchase events and purchase events each month between June 1st and July 31st in 2017.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq268",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Identify the longest number of days between the first visit and the last recorded event (either the last visit or the first transaction) for a user where the last recorded event was associated with a mobile device.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq270",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What were the monthly add-to-cart and purchase conversion rates, calculated as a percentage of pageviews, from January to March 2017?",
        "external_knowledge": "ga360_hits.eCommerceAction.action_type.md"
    },
    {
        "instance_id": "bq275",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Can you provide a list of visitor IDs for those who made their first transaction on a mobile device on a different day than their first visit?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq374",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Calculates the percentage of new users who, between August 1, 2016 and April 30, 2017, both stayed on the site for more than 5 minutes during their initial visit and made a purchase on a subsequent visit, relative to the total number of new users in the same period.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq029",
        "db": "spider2-public-data.patents",
        "question": "Get the number of patent publications and the average number of inventors per patent in the US every five years from 1945 to 2020?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq026",
        "db": "spider2-public-data.patents",
        "question": "For the assignee who has been the most active in the patent category 'A61', I'd like to know the five patent jurisdictions code where they filed the most patents during their busiest year, separated by commas.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq026_1",
        "db": "spider2-public-data.patents",
        "question": "In which year did the assignee with the most applications in the patent category 'A61' file the most?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq026_2",
        "db": "spider2-public-data.patents",
        "question": "For patent class A01B3, I want to analyze the information of the top 3 assignees based on the total number of applications. Please provide the following five pieces of information: the names of these assignees, their total number of applications, the year with the most applications, the number of applications in that year, and the country code with the most applications during that year.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq033",
        "db": "spider2-public-data.patents",
        "question": "How many U.S. patent applications related to IoT applications (where the abstract includes the phrase 'internet of things') were filed each month from 2008 to 2022?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq209",
        "db": "spider2-public-data.patents",
        "question": "Can you find how many utility patents granted in 2010 have exactly one forward citation within the ten years following their application date?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq027",
        "db": "spider2-public-data.patents",
        "question": "For patents granted between 2010 and 2018, provide the publication number of each patent and the number of backward citations it has received in the SEA category.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq210",
        "db": "spider2-public-data.patents",
        "question": "How many US B2 patents granted between 2008 and 2018 contain claims that do not include the word 'claim'?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq211",
        "db": "spider2-public-data.patents",
        "question": "Among patents granted between 2010 and 2023 in CN, how many of them belong to families that have a total of over one distinct applications?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq213",
        "db": "spider2-public-data.patents",
        "question": "What is the most common 4-digit IPC code among US B2 utility patents granted from June to August in 2022?",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq213_1",
        "db": "spider2-public-data.patents",
        "question": "For US B2 utility patents granted from June to September in 2022, identify the most frequent 4-digit IPC code for each patent. Then, list the publication numbers and IPC4 codes of patents where this code appears 10 or more times.",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq214",
        "db": "spider2-public-data.patents_google",
        "question": "For US B2 patents granted between 2010 and 2014, find the one with the most forward citations within a month of its filing date, and identify the most similar patent from the same filing year, regardless of its type.",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq214_1",
        "db": "spider2-public-data.patents_google",
        "question": "Identify the top five patents filed in the same year as `US-9741766-B2` that are most similar to it based on technological similarities. Please provide the publication numbers.",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq247",
        "db": "spider2-public-data.patents_google",
        "question": "Which valid family has the most publications? Just provide their non-empty publication abstracts.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq215",
        "db": "spider2-public-data.patents",
        "question": "What is the publication number of US patent granted during 2015 to 2018, with the highest originality score based on the diversity of 4-digits IPC codes from its backward citations?",
        "temporal": "Yes",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq222",
        "db": "spider2-public-data.patents",
        "question": "Find the CPC technology areas in Germany with the highest exponential moving average of patent filings each year (smoothing factor 0.1) for patents granted in December 2016. Show me the full title, CPC group and the best year for each CPC group at level 4.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq221",
        "db": "spider2-public-data.patents",
        "question": "Identify the CPC technology areas with the highest exponential moving average of patent filings each year (smoothing factor 0.2), and provide the full title and the best year for each CPC group at level 5.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq223",
        "db": "spider2-public-data.patents",
        "question": "Which assignee and primary CPC subclass full title most frequently cite patents assigned to 'DENSO CORP'?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq420",
        "db": "spider2-public-data.patents\nbigquery-public-data.uspto_oce_assignment\nbigquery-public-data.uspto_oce_cancer\nbigquery-public-data.uspto_oce_claims\nbigquery-public-data.uspto_oce_litigation\nbigquery-public-data.uspto_ptab",
        "question": "Can you identify the top 5 patents that were initially rejected under section 101 with no allowed claims, based on the length of their granted claims? The patents should have been granted in the US between 2010 and 2023. Additionally, ensure to select the first office action date for each application. Please include their first publication numbers, along with their first publication dates, length of the filed claims and grant dates.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq207",
        "db": "spider2-public-data.patents\nbigquery-public-data.uspto_oce_assignment\nbigquery-public-data.uspto_oce_cancer\nbigquery-public-data.uspto_oce_claims\nbigquery-public-data.uspto_oce_litigation\nbigquery-public-data.uspto_ptab",
        "question": "Can you provide the initial publication numbers for our top 100 independent patent claims with the highest word count?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq246",
        "db": "spider2-public-data.patentsview",
        "question": "Can you figure out the number of forward citations within 3 years from the application date for the patent that has the most backward citations within 3 years from application among all U.S. patents?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq052",
        "db": "spider2-public-data.patentsview",
        "question": "I wonder which patents within CPC subsection 'C05' or group 'A01G' in the USA have at least one forward or backward citations within one month of their application dates. Give me the ids, titles, application date, forward/backward citation counts and summary texts.",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "sf014",
        "db": "CENSUS_GALAXY__AIML_MODEL_DATA_ENRICHMENT_SAMPLE.PUBLIC",
        "question": "What is the New York State ZIP code with the highest number of commuters traveling over one hour, according to 2021 ACS data? Include the total commuters, state benchmark for this duration, and state population.",
        "external_knowledge": null
    }
]